const express = require('express');
const cors = require('cors'); // Імпортуємо cors
const app = express();
const port = process.env.PORT || 3000;

app.use(cors()); // Додаємо middleware для CORS
app.use(express.json());

const plants = {
	'Декоративно-листяні': {
		3: {
			id: 30,
			name: 'Хамедорея',
			price: 500,
			img: [
				'https://i.pinimg.com/564x/44/51/bd/4451bd3dbc4ef1e20caa4b5ed0aa8fd2.jpg',
				'https://i.pinimg.com/564x/2e/8a/9d/2e8a9d45c321e46cbc888a4b80dd5d99.jpg',
				'https://i.pinimg.com/564x/8e/3b/a9/8e3ba9cf221bbca66f7e5156a9fd6273.jpg',
			],
			flowerSize: '100',
			desc: 'Це рід пальм, що включає різні види, висота яких може варіюватися. Зазвичай, вони досягають висоти від 1 до 3 метрів, в залежності від конкретного виду. Наприклад, Хамедорея елеганс (Chamaedorea elegans) зазвичай має висоту близько 1-1.5 метра.',
			conditionsСare:
				'Хамедорея потребує яскравого, розсіяного світла, помірного поливу з підсиханням верхнього шару ґрунту, високої вологості повітря, легкого дренованого субстрату та підживлення рідким добривом під час активного росту',
			status: 'Розпродаж',
			soilType:
				'Хамедорея найкраще росте в добре дренованому, легкому ґрунті з додаванням торфу або піску.',
			temperature:
				'Оптимальна температура для хамедореї становить від 16°C до 24°C',
			lightRequirement:
				'Рослина потребує яскравого, але розсіяного світла, уникаючи прямого сонця.',
			humidityLevel:
				'Хамедорея любить високу вологість, тому її слід регулярно обприскувати або тримати в приміщеннях з вологою атмосферою.',
		},
		4: {
			id: 40,
			name: 'Фікус Лірата Бамбіно',
			price: 630,
			img: [
				'https://i.pinimg.com/control/564x/e0/45/ff/e045ff7d12d164ff37f040df0c7b6dd4.jpg',
				'https://i.pinimg.com/564x/57/50/97/57509737af0a49f1d6480346b10e8486.jpg',
				'https://i.pinimg.com/control/564x/8b/2b/c8/8b2bc8cca39beafb234f037feeb39e75.jpg',
			],
			flowerSize: '45',
			desc: "це компактна декоративно-листяна рослина з великими, вражаючими листками, які мають характерну хвилясту форму. Ця рослина додає елегантності будь-якому інтер'єру завдяки своїй пишній зелені і стрункій формі",
			conditionsСare:
				'потребує яскравого, розсіяного освітлення та помірного поливу, дозволяючи верхньому шару ґрунту підсохнути між поливами. Рекомендується регулярно обприскувати листя, щоб підтримувати необхідну вологість.',
			soilType:
				'Фікус Лірата Бамбіно потребує добре дренованого ґрунту, багатого на органічні речовини.',
			temperature:
				'Ідеальна температура для фікуса становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина потребує яскравого, але розсіяного світла без прямого сонячного проміння.',
			humidityLevel:
				'Фікус Лірата Бамбіно полюбляє високу вологість, тому корисно регулярно обприскувати листя.',
		},
		5: {
			id: 50,
			name: 'Кротон Екселент',
			price: '749',
			img: [
				'https://flowers.ua/images/Flowers/articles/293-img-1.jpg',
				'https://i.pinimg.com/564x/e6/48/12/e64812514944a7a719b23c1113cb8fb4.jpg',
				'https://i.pinimg.com/564x/82/4b/72/824b72cddee7e2a10553ec8528c10719.jpg',
			],
			flowerSize: '50',
			isFlowering: false,
			desc: "Це яскрава декоративно-листяна рослина, відома своїми великими, різнокольоровими листками, які мають насичені жовті, червоні та зелені відтінки. Завдяки своїй привабливій формі і кольору, ця рослина стає яскравим акцентом у будь-якому інтер'єрі.",
			conditionsСare:
				'Кротон Екселент потребує яскравого світла для підтримання насиченості кольорів, а полив має бути регулярним, дозволяючи верхньому шару ґрунту підсохнути між поливами. Важливо уникати застою води, щоб запобігти гниттю коренів',
			soilType:
				'Кротон Екселент потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для кротона становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина потребує яскравого, розсіяного світла, але без прямого сонячного проміння.',
			humidityLevel:
				'Кротон Екселент полюбляє високу вологість, тому обприскування листя буде корисним.',
		},
		6: {
			id: 60,
			name: 'Заміокулькас',
			price: '1520',
			img: [
				'https://cdn.asterias.od.ua/images/81/81-2-61-700x700.jpg',
				'https://i.pinimg.com/564x/bf/8b/54/bf8b5447377e0345f64fa62c459b735e.jpg',
				'https://i.pinimg.com/564x/79/09/36/790936307b7ae1b99c4897462e176ae6.jpg',
			],
			flowerSize: '75',
			desc: 'відомий також як "щастя дерева" або "доларове дерево", є стійкою та невибагливою рослиною з глянцевими, темно-зеленими листками, які ростуть на м\'ясистих черешках. Ця рослина популярна завдяки своїй здатності витримувати низьку освітленість і нерегулярний полив, що робить її ідеальним вибором для офісів та житлових приміщень',
			conditionsСare:
				'потребує яскравого, але розсіяного світла, і не вимагає частого поливу — поливайте рослину, коли верхній шар ґрунту повністю підсохне. Важливо використовувати добре дренований ґрунт, щоб уникнути застою води.',
			soilType:
				'Заміокулькас потребує добре дренованого ґрунту з додаванням піску або перліту для кращого водовідведення.',
			temperature:
				'Ідеальна температура для заміокулькаса становить від 18°C до 26°C.',
			lightRequirement:
				'Рослина добре росте при яскравому непрямому світлі, але може переносити і затінені умови.',
			humidityLevel:
				'Заміокулькас добре переносить низький рівень вологості, але регулярне обприскування підвищує його комфорт.',
		},
		7: {
			id: 70,
			name: 'Фікус Кінкі',
			price: '890',
			img: [
				'https://i.pinimg.com/564x/b9/54/b7/b954b7fd3a93c1e243f4b6560209219a.jpg',
				'https://i.pinimg.com/564x/2a/c3/e7/2ac3e7b1300f2f050e3352261c0d1bc6.jpg',
				'https://i.pinimg.com/564x/3e/5e/51/3e5e51c15ea2b317e216af42b93de2e8.jpg',
			],
			flowerSize: '50',
			isFlowering: false,
			desc: 'це компактний і декоративний сорт фікуса з маленькими глянцевими зеленими листками з білими або кремовими краями. Він є популярною кімнатною рослиною завдяки своєму вишуканому зовнішньому вигляду і здатності добре рости в домашніх умовах. Його невеликий розмір робить його чудовим вибором для обмежених просторів.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але може переносити і напівтінь. Поливати його варто тоді, коли верхній шар ґрунту підсихає. Уникайте перезволоження ґрунту. Для кращого росту використовуйте добре дренований ґрунт і забезпечте помірну вологість повітря.',
			soilType:
				'Фікус Кінкі потребує легкого, добре дренованого ґрунту з високим вмістом органіки.',
			temperature:
				'Оптимальна температура для фікуса становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина потребує яскравого розсіяного світла, проте уникайте прямих сонячних променів.',
			humidityLevel:
				'Фікус Кінкі полюбляє підвищену вологість, тому обприскування листя буде корисним.',
		},
		8: {
			id: 80,
			name: 'Монстера',
			price: '1650',
			img: [
				'https://azalianow.ru/blog/wp-content/uploads/2024/08/Monstera-Delicioza-150-sm-ot-AzaliaNow.webp',
				'https://i.pinimg.com/564x/04/c5/6a/04c56ad01ab9d1db84646a150f35eea5.jpg',
				'https://i.pinimg.com/564x/7a/ee/f5/7aeef5fd34871ea84bafff216c1b8b0e.jpg',
			],
			flowerSize: '80',
			desc: "це популярна декоративна рослина, відома своїм екзотичним виглядом і великими, розрізаними листками, які можуть досягати вражаючих розмірів. Її темно-зелені листки мають характерні отвори і рвані краї, що надає їй оригінальний вигляд. Завдяки своїй невибагливості та витривалості, Монстера чудово підходить для вирощування в кімнатних умовах і є фаворитом серед дизайнерів інтер'єрів.', conditionsСare: 'Монстера потребує яскравого, але розсіяного світла, може переносити напівтінь. Поливайте рослину, коли ґрунт зверху підсихає, уникаючи надлишкової вологи. Для кращого росту забезпечте високу вологість і періодично протирайте листки від пилу. Важливо також підпирати рослину, оскільки вона любить витися.",
			soilType:
				'Монстера потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Ідеальна температура для монстери становить від 18°C до 27°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому розсіяному світлу, але може витримувати і легке затінення.',
			humidityLevel:
				'Монстера полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		9: {
			id: 90,
			name: 'Фікус Бенжаміна Екзотіка',
			price: '2440',
			img: [
				'https://i.pinimg.com/564x/45/41/3c/45413c7a0cadbda10b007ac6ea4232cd.jpg',
				'https://i.pinimg.com/564x/5a/aa/9e/5aaa9e671bd7f26539a4118fca3a30bc.jpg',
				'https://cdn.7days.ru/pic/36c/972854/1388843/86.jpg',
			],
			flowerSize: '150',
			desc: 'це елегантна кімнатна рослина з витонченими, дрібними, блискучими листками, що надають їй ніжного та розкішного вигляду. Вона відома своєю здатністю очищати повітря, тому популярна в офісах і житлових приміщеннях. Фікус Бенжаміна Екзотіка — це ідеальний вибір для створення затишної атмосфери в інтер’єрі.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але також може рости в напівтіні. Важливо підтримувати рівномірний полив — ґрунт повинен бути злегка вологим, але не перезволоженим. Рослина чутлива до змін умов, тому варто уникати різких коливань температури та протягів.',
			soilType:
				'Фікус Бенжаміна Екзотіка потребує легкого, добре дренованого ґрунту з високим вмістом органіки.',
			temperature:
				'Оптимальна температура для фікуса становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому розсіяному світлу, але може витримувати легке затінення.',
			humidityLevel:
				'Фікус Бенжаміна Екзотіка полюбляє підвищену вологість, тому регулярне обприскування листя буде корисним.',
		},
		10: {
			id: 100,
			name: 'Традесканція Білоквіткова',
			price: '720',
			img: [
				'https://i.pinimg.com/control/564x/3c/d4/16/3cd41614312425742f46776ad913ef22.jpg',
				'https://i.pinimg.com/control/564x/9a/3c/7e/9a3c7e318b39bc4e6747a4f2dd4f2798.jpg',
				'https://i.pinimg.com/control/564x/ad/b7/e8/adb7e81c03384eb5cb0ebfed88554ba7.jpg',
			],
			flowerSize: '40',
			desc: 'це невибаглива декоративна рослина з ніжними білими квітами та довгими, звисаючими стеблами, вкритими зеленими або смугастими листками. Ця рослина відома своєю здатністю швидко рости, утворюючи густі килимки або вишукані каскадні форми, що робить її ідеальним вибором для підвісних горщиків або декоративних композицій.',
			conditionsСare:
				'любить яскраве розсіяне світло, але може витримувати і півтінь. Полив повинен бути регулярним, але не надмірним — ґрунт має бути вологим, але без застою води. Вона добре росте в умовах підвищеної вологості та потребує періодичного обрізання для збереження форми.',
			soilType:
				'Традесканція Білоквіткова потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Ідеальна температура для традесканції становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але може витримувати легке затінення.',
			humidityLevel:
				'Традесканція Білоквіткова полюбляє підвищену вологість, тому обприскування листя буде корисним.',
		},
	},
	'Декоративно-квітучі': {
		11: {
			id: 110,
			name: 'Спатифілум',
			price: '950',
			img: [
				'https://i.pinimg.com/736x/f1/7c/2b/f17c2bb497112cb7f1049e0e739a4a36.jpg',
				'https://i.pinimg.com/474x/52/42/93/524293248bacc89b18d0dd67615feaa6.jpg',
				'https://i.pinimg.com/564x/ba/00/f1/ba00f1242c394f0266edc3b56732d2a8.jpg',
			],
			flowerSize: '70',
			desc: 'відомий також як "жіноче щастя", — це вічнозелена кімнатна рослина з елегантними білими квітками і блискучими темно-зеленими листками. Він не тільки додає краси приміщенню, але й очищує повітря, що робить його популярним вибором для дому та офісу. Спатифілум відомий своєю невибагливістю та здатністю рости навіть у менш сприятливих умовах.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але може рости й у затінених місцях. Поливати рослину слід регулярно, підтримуючи вологий ґрунт, але не допускаючи застою води. Він також любить підвищену вологість і потребує регулярного обприскування. Чутливий до протягів та різких перепадів температури.',
			soilType:
				'Спатифілум потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Ідеальна температура для спатифілума становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина добре росте при яскравому розсіяному світлі, але може переносити і легке затінення.',
			humidityLevel:
				'Спатифілум полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		12: {
			id: 120,
			name: 'Лаванда Florium',
			price: '900',
			img: [
				'https://i.pinimg.com/564x/dd/c1/81/ddc18103d1f3fac0d4a335f5f771025b.jpg',
				'https://cdn.27.ua/sc--media--prod/default/fb/df/b2/fbdfb2da-09a0-4842-970d-5fe708e5f52e.jpg',
				'https://i.pinimg.com/564x/48/5f/77/485f77ba164d138a8feabbc8e8f0400f.jpg',
			],
			flowerSize: '40',
			desc: 'Лаванда Florium — це компактний сорт лаванди з інтенсивно синьо-фіолетовими квітками та сріблясто-зеленим листям. Вона відома своїм приємним ароматом, який заспокоює та створює атмосферу затишку. Ця лаванда чудово підходить для вирощування в саду, на балконі чи у кімнатних умовах, а також ідеальна для створення ароматних букетів чи декоративних композицій.',
			conditionsСare:
				'Лаванда потребує яскравого сонячного світла і добре дренованого ґрунту. Полив має бути помірним, особливо слід уникати перезволоження. Ця рослина стійка до посухи, тому поливати її варто лише тоді, коли ґрунт добре підсох. Лаванда полюбляє теплі місця і не переносить надмірну вологість та сильні морози.',
			soilType:
				'Лаванда Florium потребує добре дренованого ґрунту з нейтральною або слабо лужною реакцією.',
			temperature:
				'Оптимальна температура для лаванди становить від 15°C до 25°C.',
			lightRequirement:
				'Рослина потребує яскравого сонячного світла, від 6 до 8 годин на день.',
			humidityLevel:
				'Лаванда не любить високу вологість і краще росте в сухих умовах, тому надмірне поливання слід уникати.',
		},
		13: {
			id: 130,
			name: 'Азалія Мікс',
			price: '1850',
			img: [
				'https://shop.camellia.ua/upload/kamelia_flora/photos/4c/61/1200x1200/40125776_64749a2718ce1.JPG',
				'https://www.nl.ua/upload/iblock/c10/242669_2.jpeg',
				'https://begreen.com.ua/wp-content/uploads/Azaliya-v-gorshke-kupit-Kiev-LEPESTOK.jpg',
			],
			flowerSize: '60',
			desc: 'Азалія Мікс — це елегантна кімнатна рослина, яка прикрашена яскравими, пишними квітами різних відтінків, включаючи рожевий, червоний та білий. Завдяки своїй унікальній формі на штамбі, ця рослина стає справжньою окрасою будь-якого інтер’єру. Азалії відомі своєю красою та елегантністю, але також вимагають уваги і догляду.',
			conditionsСare:
				'Азалія потребує яскравого, але розсіяного світла. Вона любить прохолоду і найкраще росте при температурі +15...+20 °C. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Важливо забезпечити їй високу вологість повітря, тому обприскування буде корисним. Після цвітіння рослину слід підрізати для підтримки її форми.',
			soilType:
				'Азалія Мікс потребує легкого, кисло-реактивного ґрунту, з хорошим дренажем.',
			temperature:
				'Оптимальна температура для азалії становить від 15°C до 20°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Азалія полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		14: {
			id: 140,
			name: 'Гортензія Мікс',
			price: '1200',
			img: [
				'https://cdn.asterias.od.ua/images/5/5-1-88-700x705.jpg',
				'https://i.pinimg.com/564x/62/4e/dc/624edc03a2628aa691c987cd2cc1961c.jpg',
				'https://kvetki-minsk.by/wp-content/uploads/2017/12/%D0%B3%D0%BE%D1%80%D1%82%D0%B0-%D1%81%D0%B8%D0%BD%D1%8F%D1%8F.jpg',
			],
			flowerSize: '25',
			desc: "Гортензія Мікс — це яскрава кімнатна рослина з великими пишними квітами, які можуть мати різні відтінки: від блакитного до рожевого і білого. Вона відома своєю розкішною формою та пишним цвітінням, що робить її прекрасним акцентом у будь-якому інтер'єрі. Гортензії часто використовують для створення квіткових композицій і букетів.",
			conditionsСare:
				'Гортензія потребує яскравого, але розсіяного світла. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Вона любить високу вологість, тому обприскування листя буде корисним. Оптимальна температура для росту — +18...+24 °C. Після цвітіння рекомендується підрізати рослину для підтримки її форми і стимуляції нового росту.',

			soilType:
				'Гортензія Мікс потребує родючого, добре дренованого ґрунту з кислотою або нейтральною реакцією.',
			temperature:
				'Оптимальна температура для гортензії становить від 15°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але може переносити легке затінення.',
			humidityLevel:
				'Гортензія полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		15: {
			id: 150,
			name: 'Карісса Balemala',
			price: '950',
			img: [
				'https://cdn.27.ua/sc--media--prod/default/10/a4/c0/10a4c0d7-5b2a-48e2-8095-dd20014032a3.jpg',
				'https://file.agro-market.net/upload/resize_cache/iblock/e43/345_483_1/lc4kvu9p3dfjqklufgxgprhgram1kkfn.jpeg',
				'https://images.prom.ua/2413477481_w600_h600_2413477481.jpg',
			],
			flowerSize: '30',
			isFlowering: true,
			desc: 'Карісса Balemala — це компактна кімнатна рослина, що славиться своїми блискучими темно-зеленими листками та ароматними білими квітами, які переходять у маленькі червоні ягоди. Ця рослина не тільки приваблива, але й корисна, оскільки її ягоди їстівні та мають чудовий смак. Карісса чудово підходить для вирощування в контейнерах і може стати окрасою будь-якого інтер’єру.',
			conditionsСare:
				'Карісса Balemala потребує яскравого, але розсіяного світла. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Вона добре росте при температурі +18...+25 °C і потребує періодичного обприскування, особливо в суху пору року. Важливо також забезпечити рослину добрим дренажем, щоб уникнути застою води.',
			soilType:
				'Карісса потребує легкого, добре дренованого ґрунту, з високим вмістом органіки.',
			temperature:
				'Оптимальна температура для карісси становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина потребує яскравого, непрямого світла, але може переносити і легке затінення.',
			humidityLevel:
				'Карісса добре переносить низький рівень вологості, але регулярне обприскування листя може бути корисним.',
		},
		16: {
			id: 160,
			name: 'Антуріум Success Red',
			price: '1450',
			img: [
				'https://yaskravaklumba.com.ua/image/cache/catalog/komnatnye/anturium/succes-red_01-500x500.jpg',
				'https://i.pinimg.com/564x/39/5f/80/395f806806bdb625f41761da31b02fd8.jpg',
				'https://i.pinimg.com/564x/05/c5/7f/05c57f96d5e6e3822081008fcf1d62a2.jpg',
			],
			flowerSize: '60',
			desc: 'Антуріум Success Red — це вражаюча кімнатна рослина з яскравими червоними квітами у формі серця і блискучими зеленими листками. Ця рослина є символом краси та процвітання і часто використовується для декорування інтер’єрів завдяки своїй екзотичній естетиці. Антуріум також славиться своєю здатністю очищати повітря, що робить його популярним вибором для дому та офісу.',
			conditionsСare:
				'Антуріум Success Red потребує яскравого, але розсіяного світла для оптимального цвітіння. Поливати рослину слід регулярно, але уникати перезволоження; ґрунт повинен бути злегка вологим, але не мокрим. Оптимальна температура для росту — +18...+28 °C, а також важливо підтримувати високу вологість повітря. Підживлення рослини слід проводити кожні 4-6 тижнів під час вегетаційного періоду.',
			soilType:
				'Антуріум Success Red потребує легкого, добре дренованого ґрунту з високим вмістом органіки.',
			temperature:
				'Оптимальна температура для антуріума становить від 18°C до 27°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Антуріум полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		17: {
			id: 170,
			name: 'Антуріум Black Queen',
			price: '1700',
			img: [
				'https://i.pinimg.com/564x/7b/a4/f3/7ba4f32b11b3a404e62dd37e47f4f964.jpg',
				'https://sharm24.com.ua/images/detailed/1/anthurium-an-black-queen-d17-l65.jpg',
				'https://i.pinimg.com/564x/89/69/bd/8969bda59b0eb5f1a07ad4a055727af4.jpg',
			],
			flowerSize: '70',
			isFlowering: true,
			desc: "Антуріум Black Queen — це вишукана кімнатна рослина, що вирізняється своїми темно-червоними або майже чорними квітами та глянцевими зеленими листками. Ця рослина додає екзотичності та елегантності будь-якому інтер'єру. Антуріум Black Queen не тільки привабливий, але й здатний очищати повітря, що робить його популярним вибором для дому та офісу.",
			conditionsСare:
				'Антуріум Black Queen потребує яскравого, але розсіяного світла для найкращого росту та цвітіння. Поливати рослину слід регулярно, дотримуючись помірності — ґрунт повинен бути вологим, але не мокрим. Оптимальна температура для росту — +18...+28 °C, і важливо підтримувати високу вологість повітря. Підживлення можна проводити кожні 4-6 тижнів під час вегетаційного періоду, щоб забезпечити рослині необхідні поживні речовини.',

			soilType:
				'Антуріум Black Queen потребує легкого, добре дренованого ґрунту з високим вмістом органіки.',
			temperature:
				'Оптимальна температура для антуріума становить від 18°C до 27°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Антуріум Black Queen полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		18: {
			id: 180,
			name: 'Азалія Мікс ',
			price: '950',
			img: [
				'https://img.auchan.ua/rx/q_90,ofmt_webp/auchan.ua/media/catalog/product/7/6/7600000115402_1.jpg',
				'https://i.pinimg.com/564x/40/1b/ae/401baebbb45d725db6f17c546da757bb.jpg',
				'https://images.floristics.info/images/stati_photo4/azalea-v-1/azalea-v-1-1.jpg',
			],
			flowerSize: '40',
			desc: "Азалія Мікс  — це компактна кімнатна рослина, що має яскраві та пишні квіти різних відтінків, таких як рожевий, червоний та білий. Ця рослина відзначається своєю красою і є ідеальним вибором для прикраси інтер'єру, надаючи йому свіжого вигляду. Азалії дуже популярні завдяки своїй елегантності та здатності цвісти в зимовий період.",
			conditionsСare:
				'Азалія потребує яскравого, але розсіяного світла для оптимального зростання. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, проте важливо уникати перезволоження. Азалія найкраще росте при температурі +15...+20 °C і потребує високої вологості повітря, тому обприскування буде корисним. Після цвітіння рекомендується підрізати рослину для підтримки її форми.',
			soilType:
				'Азалія Мікс потребує легкого, кисло-реактивного ґрунту, з хорошим дренажем.',
			temperature:
				'Оптимальна температура для азалії становить від 15°C до 20°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Азалія полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},

		19: {
			id: 190,
			name: 'Хризантема',
			price: '450',
			img: [
				'https://cdn.asterias.od.ua/images/104/104-2-38-700x690.jpg',
				'https://i.pinimg.com/564x/79/31/90/793190d65dcd2f261fcc3d8afe87e640.jpg',
				'https://i.pinimg.com/564x/ab/69/77/ab6977961f9c076eaefc4e79aa8394cb.jpg',
			],
			flowerSize: '30',
			desc: 'Хризантема — це яскрава і жива кімнатна рослина, відома своїми різноманітними кольорами та формами квітів. Ця рослина символізує радість і дружбу, а також є популярним вибором для декорування інтер’єрів завдяки своєму тривалому цвітінню. Хризантеми можуть мати квіти різних відтінків — від жовтого до червоного та білого, що робить їх чудовим доповненням до будь-якого простору.',
			conditionsСare:
				'Хризантема потребує яскравого сонячного світла для найкращого цвітіння, але також може переносити часткову тінь. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Оптимальна температура для росту — +15...+20 °C. Після цвітіння рослину рекомендується обрізати, щоб стимулювати новий ріст та підтримувати її форму.',
			soilType:
				'Хризантема потребує родючого, добре дренованого ґрунту з нейтральною реакцією.',
			temperature:
				'Оптимальна температура для хризантеми становить від 15°C до 20°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу, з більш ніж 6 годинами освітлення на день.',
			humidityLevel:
				"Хризантема не вимагає високої вологості, але регулярний полив є важливим для її здоров'я.",
		},
		20: {
			id: 200,
			name: 'Троянда Мікс 10x20 см',
			price: '1200',
			img: [
				'https://movakvitiv.com/wp-content/uploads/2022/09/troyanda-mistse.jpg',
				'https://images.prom.ua/5256935482_w640_h640_rozy-komnatnye-rozy.jpg',
				'https://supercomputer.com.ua/wp-content/uploads/komnatnaya-roza-foto-683-28565.jpg',
			],
			flowerSize: '40',
			desc: 'Троянда Мікс 10x20 см — це компактна кімнатна рослина, що має яскраві, ароматні квіти в різних кольорах, таких як червоний, рожевий, білий і жовтий. Ця рослина не тільки прикрашає інтер’єр, але й наповнює його чудовим ароматом. Троянди символізують кохання та красу, що робить їх популярним вибором для подарунків та декорування.',
			conditionsСare:
				'Троянда потребує яскравого світла для оптимального зростання і цвітіння. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати перезволоження. Оптимальна температура для росту — +18...+24 °C. Рослина також потребує підживлення під час вегетаційного періоду, щоб забезпечити необхідні поживні речовини. Після цвітіння рекомендується обрізати зів’ялі квіти для стимуляції нового цвітіння.',

			soilType:
				'Троянда Мікс потребує родючого, добре дренованого ґрунту з нейтральною або слабо кислою реакцією.',
			temperature:
				'Оптимальна температура для троянд становить від 15°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу, з не менше ніж 6 годинами освітлення на день.',
			humidityLevel:
				'Троянди вимагають середнього рівня вологості, тому регулярний полив важливий, особливо в спекотні дні.',
		},

		21: {
			id: 210,
			name: 'Ю-Джига Пеларгонія',
			price: '980',
			img: [
				'https://cdn.27.ua/sc--media--prod/default/ae/f5/ff/aef5ff35-8075-463f-b338-6fd921d1013a.jpg',
				'https://i.pinimg.com/564x/15/5d/e4/155de4c4fb535626c73c483a3c8ce01e.jpg',
				'https://i.pinimg.com/564x/39/5f/f8/395ff8d14f26437cb95dbda17b35148f.jpg',
			],
			flowerSize: '40',
			desc: 'Ю-Джига Пеларгонія — це яскрава кімнатна рослина, відома своїми красивими квітами, які нагадують троянди, і стійким ароматом. Ця рослина додає елегантності будь-якому простору завдяки своїм пишним і соковитим листям, а також розкішному цвітінню. Пеларгонія часто використовується для прикраси інтер’єрів, а також підходить для вирощування на балконах і в садах.',
			conditionsСare:
				"Пеларгонія потребує яскравого світла для оптимального росту і цвітіння. Поливати рослину слід помірно, даючи ґрунту підсохнути між поливами, щоб уникнути перезволоження. Оптимальна температура для росту — +18...+24 °C. Пеларгонія не любить холод і протяги, тому важливо забезпечити їй комфортні умови. Регулярне підживлення в період активного росту допоможе підтримувати її здоров'я та красу.",
			soilType:
				'Ю-Джига Пеларгонія потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для пеларгонії становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але може витримувати і легке затінення.',
			humidityLevel:
				'Пеларгонія не любить надмірну вологість, тому полив слід здійснювати помірно.',
			status: 'Новинки',
		},
	},
	Орхідеї: {
		0: {
			id: 0,
			name: 'Дендробіум',
			price: 500,
			img: [
				'https://shop.camellia.ua/upload/kamelia_flora/photos/49/2d/1200x1200/ce67be92_6475f990b5b9d.JPG',
				'https://i.pinimg.com/564x/ff/98/7e/ff987ebf55658084ba8ccc6156a34f82.jpg',
				'https://i.pinimg.com/564x/9b/d5/aa/9bd5aa6f7cfc03c26b4e32c49c91b232.jpg',
			],
			flowerSize: '70',
			desc: 'це один з найпопулярніших родів орхідей, що налічує понад 1800 видів. Ці вражаючі рослини відомі своїм різноманіттям форм, кольорів та розмірів. Вони можуть мати стебла від коротких до довгих, а квіти — від маленьких до великих, зазвичай з яскравими і насиченими кольорами: від білого до рожевого, жовтого, фіолетового та навіть синього.',
			conditionsСare:
				'потребує яскравого, розсіяного освітлення і регулярного поливу, але слід уникати перезволоження. Рослина краще росте в спеціалізованому субстраті для орхідей, який забезпечує добру аерацію коренів. Підживлюйте її під час активного росту, використовуючи добрива для орхідей, щоб підтримувати здоров’я та рясне цвітіння.',

			soilType:
				'Дендробіум потребує легкого, добре дренованого субстрату, що складається з кори та торфу.',
			temperature:
				'Оптимальна температура для дендробіума становить від 18°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Дендробіум полюбляє високу вологість, тому регулярне обприскування або установка вологи в повітрі будуть корисними.',
			status: 'Розпродаж',
		},
		1: {
			id: 10,
			name: 'Фаленопсис Біла',
			price: 700,
			img: [
				'https://i.pinimg.com/564x/e8/34/b0/e834b0523a8f6f796e4644bf071b1c32.jpg',
				'https://i.pinimg.com/564x/fb/c9/c2/fbc9c29060d2081e7758b04452cbbc04.jpg',
				'https://shop.camellia.ua/upload/kamelia_flora/photos/5a/70/1200x1200/d96150a4_6358e68ec09cd.JPG',
			],
			flowerSize: '70',

			desc: 'це царські квіти, які є дуже популярними серед квітникарів. Незважаючи на те, що королівська орхідея вважається більш вимогливою, ніж звичайна, з доглядом за нею справиться навіть новачок.Королівські орхідеї досить високі, мають великі квіти та тривале цвітіння, яке на 1-2 місяці довше, ніж у звичайних орхідей. У діаметрі квітки можуть досягати 20 см. А забарвлення буває абсолютно різне: білі, рожеві, в цятку, в смужку, фіолетові та багато інших. ',
			conditionsСare:
				'Для довгого цвітіння орхідеям потрібно багато світла. Ідеальні умови для них в місцях куди сонце потрапляє на декілька годин в день (зранку чи ввечері)',

			soilType:
				'Фаленопсис Біла Королівська потребує легкого, добре дренованого субстрату, що складається з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для фаленопсиса становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Фаленопсис полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		2: {
			id: 20,
			name: 'Міні орхідея',
			price: 1200,
			img: [
				'https://shop.camellia.ua/upload/kamelia_flora/photos/74/ea/1200x1200/28ea8b7_6066ee212b9ea.JPG',
				'https://i.pinimg.com/564x/81/16/d4/8116d406642881df722994694b893265.jpg',
				'https://i.pinimg.com/474x/21/bc/98/21bc98d6c7481bcb1be7c881fefa41a2.jpg',
			],
			flowerSize: '35',
			isFlowering: true,
			desc: " це вишукана композиція з різних видів мініатюрних орхідей, представлених у стильному кашпо. Ці рослини відзначаються компактними розмірами, яскравими кольорами та елегантними формами, що робить їх ідеальними для прикраси будь-якого інтер'єру. Догляд за міні орхідеями простий: вони потребують яскравого, розсіяного світла і помірного поливу. Ця композиція додасть затишку і витонченості у ваш дім або офіс! ",
			conditionsСare:
				'Міні орхідея мікс потребує яскравого, розсіяного освітлення, помірного поливу і спеціалізованого субстрату для орхідей для підтримання здоров’я та цвітіння.',
			soilType:
				'Міні орхідея мікс в кашпо потребує легкого, добре дренованого субстрату, зазвичай з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для міні орхідеї становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Міні орхідея полюбляє високу вологість, тому регулярне обприскування листя або використання зволожувача повітря буде корисним.',
		},
		51: {
			id: 510,
			name: 'Орхідея Фаленопсис Каскад',
			price: 1200,
			img: [
				'https://plantsroom.com.ua/wp-content/uploads/2024/07/img_8956-scaled.jpg',
				'https://i.pinimg.com/564x/b3/68/81/b36881e531c7932af6793a467efe47f9.jpg',
				'https://i.pinimg.com/564x/d7/a0/20/d7a02063d401230df61cbd2c7db21bb3.jpg',
			],
			flowerSize: '70',
			desc: 'Орхідея Фаленопсис Каскад - це елегантна і неповторна рослина з вигнутими квітконосами, що утворюють вражаючі каскади великих квітів. Ця орхідея відома своїми великими, яскравими квітами та довгим періодом цвітіння. Ідеально підходить для декору будь-якого простору, додаючи нотку розкоші та естетики. Вона легка в догляді: потребує помірного поливу та яскравого розсіяного світла. Орхідея Фаленопсис Каскад стане чудовим акцентом у вашому інтер’єрі.',
			conditionsСare:
				'Фаленопсис Каскад потребує яскравого, розсіяного освітлення, помірного поливу і субстрату для орхідей, щоб забезпечити її довготривале цвітіння.',
			soilType:
				'Орхідея Фаленопсис Каскад потребує легкого, добре дренованого субстрату, що складається з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для Фаленопсиса Каскад становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Фаленопсис Каскад полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Новинки',
		},
		52: {
			id: 520,
			name: 'Кімнатна рослина Камбрія мікс 12х60',
			price: 600,
			img: [
				'https://ukraflora.ua/image/cache/catalog/image/cache/catalog/content/gorschechka/kambrija_1stovbur_kaskad_1-1100x1100.webp',
				'https://floralife.com.ua/image/cache/catalog/houseplants/orchids/cambria-royal-100/orchid-cambria-royal-100-4-1000x1000.jpg',
				'https://cdn.27.ua/799/b4/96/242838_4.jpeg',
			],
			flowerSize: '60',
			desc: "Камбрія мікс - це екзотична кімнатна рослина, що поєднує кілька різновидів орхідей з вишуканими квітами. Вона відрізняється незвичайними формами квіток та приємним ароматом, що робить її ідеальною для декорування сучасних інтер'єрів. Камбрія проста в догляді, тому вона підходить як для досвідчених, так і для новачків у вирощуванні орхідей. Ця рослина додасть шарму і елегантності будь-якому приміщенню.",
			conditionsСare:
				'Камбрія мікс потребує яскравого розсіяного світла, регулярного, але помірного поливу та спеціального субстрату для орхідей для підтримання здоров’я і квітучості.',

			soilType:
				'Кімнатна рослина Камбрія мікс потребує легкого, добре дренованого субстрату, що складається з кори, моху та торфу.',
			temperature:
				'Оптимальна температура для камбрії становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Камбрія полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Розпродаж',
		},
		53: {
			id: 530,
			name: 'Фаленопсіс плямистий',
			price: 800,
			img: [
				'https://lorashen.ua/static/media/uploads/product/Rasteniya/.thumbnails/img_9315.jpg/img_9315-0x600.jpg',
				'https://images.prom.ua/5016348387_w640_h640_falenopsis-gorshechnoe-rastenie.jpg',
				'https://floralife.com.ua/image/cache/catalog/houseplants/phalaenopsis/phalaenopsis-boston-1/phalaenopsis-boston-6-1000x1000.jpg',
			],
			flowerSize: '70',
			desc: "Фаленопсіс плямистий - це надзвичайно приваблива кімнатна орхідея з унікальними квітами, вкритими плямами, що створюють екзотичний вигляд. Ця орхідея має довгу гілку з великими квітами, що тримаються на рослині протягом кількох місяців. Вона стане чудовою прикрасою для будь-якого інтер'єру, надаючи йому особливої вишуканості. Догляд за нею простий: достатньо помірного поливу та яскравого, але розсіяного світла.",
			conditionsСare:
				'Фаленопсіс плямистий потребує яскравого розсіяного освітлення, регулярного помірного поливу і субстрату для орхідей, що сприяє довготривалому цвітінню.',
			soilType:
				'Фаленопсіс плямистий потребує легкого, добре дренованого субстрату, що складається з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для Фаленопсиса плямистого становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Фаленопсіс плямистий полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
		54: {
			id: 540,
			name: 'Орхідея Фаленопсис дві гілки 12/70 см, Жовтий',
			price: 950,
			img: [
				'https://paeonia.com.ua/image/cache/catalog/products/9594/additional3-800x800.webp',
				'https://i.pinimg.com/564x/29/b5/07/29b5076ead70bac635fa391a7984740b.jpg',
				'https://i.pinimg.com/564x/a3/df/5e/a3df5ecd276f252b318dc1bae1bac0dd.jpg',
			],
			flowerSize: '70',
			desc: "Жовтий Фаленопсис з двома гілками - це яскрава і вишукана орхідея, що привертає увагу своїми сонячно-жовтими квітами. Квіти розміщені на двох довгих гілках, що надає рослині розкішного вигляду. Ідеальна для прикраси будь-якого інтер'єру, орхідея додає нотки тепла та елегантності. Вона проста у догляді: потребує помірного поливу та яскравого, розсіяного світла. Фаленопсис чудово підходить як для дому, так і для офісу.",
			conditionsСare:
				'Орхідея Фаленопсис потребує яскравого розсіяного освітлення, регулярного помірного поливу і спеціального субстрату для орхідей, щоб зберегти її здоров’я та красу.',
			soilType:
				'Орхідея Фаленопсис потребує легкого, добре дренованого субстрату, що складається з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для фаленопсиса становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Фаленопсис полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Топ продажів',
		},
		55: {
			id: 25,
			name: 'Рослина Фаленопсіс Royal',
			price: 2600,
			img: [
				'https://www.pattiflora.it/cdn/shop/products/phaleno_blu_pattiflora_1200x1200.jpg?v=1645106668',
				'https://i.pinimg.com/control/564x/33/1b/9e/331b9eb282e0af7b200a3a161b1532af.jpg',
				'https://i.pinimg.com/564x/0d/2d/71/0d2d71df8e11d06fa0b1c0979ff05591.jpg',
			],
			flowerSize: '60',
			desc: "Фаленопсіс Royal Blue - це вражаюча кімнатна рослина з одним стовбуром, що привертає увагу своїми насиченими синіми квітами. Ця орхідея має елегантний вигляд і стане яскравим акцентом у будь-якому інтер'єрі. Квіти Фаленопсіс відомі своєю довговічністю і здатністю цвісти протягом тривалого часу. Догляд за нею не складає труднощів: достатньо помірного поливу та яскравого, розсіяного світла.",
			conditionsСare:
				'Фаленопсіс Royal Blue потребує яскравого розсіяного освітлення, регулярного помірного поливу і спеціального субстрату для орхідей для забезпечення оптимальних умов для зростання.',
			soilType:
				'Рослина Фаленопсіс Royal Blue потребує легкого, добре дренованого субстрату, що складається з кори, моху та перліту.',
			temperature:
				'Оптимальна температура для Фаленопсиса становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, розсіяному світлу, але слід уникати прямих сонячних променів.',
			humidityLevel:
				'Фаленопсіс полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
		},
	},
	Сукуленти: {
		22: {
			id: 220,
			name: 'Кактус Ехінопсис Мікс Різнокольоровий',
			price: '620',
			img: [
				'https://cdn.asterias.od.ua/images/26/26-1-37-700x702.jpg',
				'https://i.pinimg.com/564x/9a/89/a3/9a89a3934e1e5359400c4be4b3ee5cd6.jpg',
				'https://i.pinimg.com/564x/0b/76/0c/0b760ce84ba01ab00dd76329d44a6746.jpg',
			],
			flowerSize: '15-25',
			isFlowering: true,
			desc: 'Кактус Ехінопсис Мікс — це компактна кімнатна рослина, яка вражає своїми яскравими, різнокольоровими квітами, що розкриваються влітку. Ці кактуси мають характерні округлі форми та густі колючки, що робить їх привабливими для колекціонування. Ехінопсиси є невибагливими рослинами, які чудово підходять для початківців у світі кактусів.',
			conditionsСare:
				'Ехінопсис потребує яскравого сонячного світла для оптимального росту. Поливати кактус слід рідко, дозволяючи ґрунту повністю висохнути між поливами. Взимку полив майже зовсім зменшується. Оптимальна температура для росту — +18...+25 °C, а в зимовий період кактуси можуть витримувати температури до +10 °C. Ці рослини також не вимагають підживлення, але можуть виграти від додавання добрив під час вегетаційного періоду.',

			soilType:
				'Кактус Ехінопсис Мікс Різнокольоровий потребує добре дренованого, легкого ґрунту, що містить пісок або перліт.',
			temperature:
				'Оптимальна температура для ехінопсиса становить від 18°C до 30°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу, тому розміщення на південному вікні є ідеальним.',
			humidityLevel:
				'Ехінопсис не потребує високої вологості і краще росте в сухих умовах, тому надмірний полив слід уникати.',
			status: 'Топ продажів',
		},
		23: {
			id: 230,
			name: 'Хавортія ',
			price: '450',
			img: [
				'https://i.pinimg.com/564x/77/e7/28/77e72839d9e0f5afe5c5f5d1b4dd50a8.jpg',
				'https://cdn.asterias.od.ua/images/136/136-14-20-700x583.jpg',
				'https://i.pinimg.com/564x/23/73/0f/23730fea17b4cb7a4c1821a9fc54c07d.jpg',
			],
			flowerSize: '10',
			isFlowering: false,
			desc: "Хавортія — це компактна сукулентна рослина з характерними товстими, м'ясистими листками, які можуть бути темно-зеленими або з білими смужками. Ця рослина ідеально підходить для вирощування в кімнатних умовах, оскільки вона стійка до посухи та не вимагає складного догляду. Хавортія привносить зелені акценти у ваш інтер’єр і є чудовим вибором для початківців у світі кімнатних рослин.",
			conditionsСare:
				'Хавортія потребує яскравого, але розсіяного світла. Поливати рослину слід рідко, даючи ґрунту повністю висохнути між поливами. Вона добре переносить тепле і сухе середовище, тому оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити до мінімуму. Рослина не потребує частого підживлення, але можна використовувати добрива для кактусів у період активного росту.',
			soilType:
				'Хавортія потребує добре дренованого, легкого ґрунту, зазвичай з додаванням піску або перліту.',
			temperature:
				'Оптимальна температура для хавортії становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може переносити легке затінення.',
			humidityLevel:
				'Хавортія не потребує високої вологості, тому полив слід здійснювати помірно, уникаючи надмірного зволоження.',
			status: 'Розпродаж',
		},
		24: {
			id: 240,
			name: 'Алоє Мікс',
			price: '500',
			img: [
				'https://mrsad.ru/wp-content/uploads/2015/08/000015-e1440069689212-600x455.jpg',
				'https://i.pinimg.com/736x/5b/48/f6/5b48f657740a762334d2476986cfead6.jpg',
				'https://i.pinimg.com/564x/d2/74/7b/d2747b3b847205fd30cbdf6a68c668a1.jpg',
			],
			flowerSize: '30',
			desc: 'Алоє Мікс — це сукулентна кімнатна рослина, відома своїми соковитими листками, що містять корисні речовини, які часто використовуються в медицині та косметології. Алоє має гарний зелений колір та характерні колючі краї, що робить його привабливим елементом декору. Ця рослина проста в догляді, ідеально підходить для початківців.',
			conditionsСare:
				'Алоє потребує яскравого світла, але може також рости в умовах часткової тіні. Поливати рослину слід рідко, даючи ґрунту повністю висохнути між поливами. Оптимальна температура для росту — +20...+25 °C. Взимку полив можна зменшити, оскільки рослина входить у стан спокою. Алоє не потребує частого підживлення, однак можна використовувати добрива для сукулентів у період активного росту.',
			soilType:
				'Алоє Мікс потребує добре дренованого, легкого ґрунту, що складається з піску та перліту.',
			temperature:
				'Оптимальна температура для алоє становить від 20°C до 30°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує щонайменше 6 годин освітлення на день.',
			humidityLevel:
				'Алоє не потребує високої вологості і краще росте в сухих умовах, тому полив слід здійснювати помірно.',
			status: 'Новинки',
		},
		25: {
			id: 250,
			name: 'Сукулент Красула Овата',
			price: '600',
			img: [
				'https://cdn.asterias.od.ua/images/128/128-1-3-700x668.jpg',
				'https://vsegda-pomnim.com/uploads/posts/2022-04/1650625930_8-vsegda-pomnim-com-p-krassula-vidi-foto-i-nazvaniya-tsvetenie-8.jpg',
				'https://i0.wp.com/succulentkupi.ru/wp-content/uploads/2021/04/krassula-jajcevidnaja-2.jpg?fit=2343%2C2343&ssl=1',
			],
			flowerSize: '25-30',
			desc: 'Красула Овата, також відома як "грошове дерево", — це популярна кімнатна рослина, яка вирізняється своїми круглими, м’ясистими листками та стійкістю до посухи. Вважається, що ця рослина приносить удачу та фінансовий добробут, що робить її бажаною для багатьох любителів рослин. Красула має компактну форму і добре підходить для вирощування в горщиках.',
			conditionsСare:
				'Красула Овата потребує яскравого світла, але може переносити і часткову тінь. Поливати рослину слід помірно, дозволяючи ґрунту повністю висохнути між поливами. Оптимальна температура для росту — +18...+24 °C. У зимовий період полив можна зменшити, оскільки рослина входить у стан спокою. Красула не потребує частого підживлення, але можна використовувати добрива для кактусів під час активного росту.',
			soilType:
				'Сукулент Красула Овата потребує добре дренованого, легкого ґрунту, збагаченого піском або перлітом.',
			temperature:
				'Оптимальна температура для красули становить від 18°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу, тому краще розміщувати її на південному вікні.',
			humidityLevel:
				'Красула Овата не потребує високої вологості і краще росте в сухих умовах, тому полив слід здійснювати помірно.',
		},
		26: {
			id: 260,
			name: 'Ріпсаліс Мікс',
			price: '850',
			img: [
				'https://cdn.asterias.od.ua/images/48/48-5-19-700x549.jpg',
				'https://orchidsart.com/wp-content/uploads/2018/11/%D1%80%D0%B8%D0%BF%D1%81%D0%B0%D0%BB%D0%B8%D1%81-14%D1%81%D0%BC.jpg',
				'https://f-f.flowers/image/cache/catalog/image/cache/catalog/produkt/komnatnye_rasteniya/sukkulenty/8008-500x600.webp',
			],
			flowerSize: '30',
			isFlowering: false,
			desc: 'Ріпсаліс Мікс — це унікальна кімнатна рослина з довгими, звисаючими стеблами, яка належить до родини кактусових. Ця рослина славиться своєю екзотичною естетикою і здатністю адаптуватися до різних умов. Ріпсаліс може мати різні варіації забарвлення, від яскраво-зеленого до сірувато-зеленого, і є ідеальним вибором для ампельних композицій.',
			conditionsСare:
				'Ріпсаліс потребує яскравого, розсіяного світла. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити. Ріпсаліс не потребує частого підживлення, але може виграти від додавання добрив для кактусів під час активного росту. Рослина також любить високу вологість, тому обприскування листя буде корисним.',
			soilType:
				'Ріпсаліс Мікс потребує добре дренованого, легкого ґрунту, що містить органічні речовини, такі як мох і перегній.',
			temperature:
				'Оптимальна температура для ріпсаліса становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може витримувати легке затінення.',
			humidityLevel:
				'Ріпсаліс полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Топ продажів',
		},
		27: {
			id: 270,
			name: 'Сансевієрія d12x40 Cylindrica',
			price: '750',
			img: [
				'https://i.pinimg.com/564x/7f/30/f0/7f30f04117999454b2156f986fdcfa80.jpg',
				'https://i.pinimg.com/control/564x/72/e9/1c/72e91c5da7acb7a86e3fb33a865e3cea.jpg',
				'https://i.pinimg.com/564x/61/9e/ff/619eff7b4af64563930551206cb6a2c1.jpg',
			],
			flowerSize: '40',
			desc: 'Сансевієрія Cylindrica, або "зміїний язик", — це вражаюча кімнатна рослина з вертикальними, циліндричними листками, які можуть досягати значної висоти. Вона відома своєю здатністю витримувати різні умови вирощування, включаючи низьку освітленість і нерегулярний полив. Сансевієрія додає елегантності і сучасного вигляду будь-якому інтер’єру.',
			conditionsСare:
				'Сансевієрія потребує яскравого, але розсіяного світла, однак може рости і в умовах слабкого освітлення. Поливати рослину слід помірно, даючи ґрунту висохнути між поливами, щоб уникнути застою води. Оптимальна температура для росту — +18...+25 °C. Сансевієрія не потребує частого підживлення, але можна використовувати добрива для кактусів під час активного росту.',
			soilType:
				'Сансевієрія Cylindrica потребує добре дренованого, легкого ґрунту, збагаченого піском або перлітом.',
			temperature:
				'Оптимальна температура для сансевієрії становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може переносити і тінь.',
			humidityLevel:
				'Сансевієрія не потребує високої вологості і краще росте в сухих умовах, тому полив слід здійснювати помірно.',
			status: 'Новинки',
		},
		29: {
			id: 290,
			name: 'Кактус Ехінокактус Grusonii 27х25',
			price: '1200',
			img: [
				'https://cdn.asterias.od.ua/images/26/26-14-3-700x548.jpg',
				'https://i.pinimg.com/564x/6c/cd/6a/6ccd6a9d490f223a81c9d9f2da59fd10.jpg',
				'https://i.pinimg.com/564x/e2/42/f9/e242f98439ee8e9de2cf7790329531e0.jpg',
			],
			flowerSize: '25',
			desc: 'Кактус Ехінокактус Grusonii, відомий також як "золоте коло", — це видовий кактус, що характеризується великими, округлими формами і яскраво-жовтими колючками. Ця рослина вражає своєю естетикою і може стати справжнім акцентом у будь-якому інтер’єрі. Ехінокактус Grusonii є відносно простим у догляді, що робить його популярним вибором для любителів кактусів.',
			conditionsСare:
				'Ехінокактус потребує яскравого сонячного світла для оптимального росту і цвітіння. Поливати кактус слід рідко, дозволяючи ґрунту повністю висохнути між поливами, особливо в зимовий період. Оптимальна температура для росту — +18...+25 °C. Взимку кактус може витримувати нижчі температури, проте не нижче +10 °C. Ця рослина також не вимагає частого підживлення, однак можна використовувати спеціалізовані добрива для кактусів у період активного росту.',
			soilType:
				'Кактус Ехінокактус Grusonii потребує добре дренованого, легкого ґрунту, збагаченого піском або перлітом.',
			temperature:
				'Оптимальна температура для ехінокактуса становить від 18°C до 30°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу, тому краще розміщувати її на південному вікні.',
			humidityLevel:
				'Ехінокактус не потребує високої вологості і краще росте в сухих умовах, тому полив слід здійснювати помірно.',
		},
	},
	'Цитрусові рослини': {
		30: {
			id: 300,
			name: 'Лимонне Дерево з Плодами',
			price: '2500',
			img: [
				'https://i.pinimg.com/564x/54/23/8c/54238c19bd79a125a6edd71b492611b9.jpg',
				'https://plantsroom.com.ua/wp-content/uploads/2024/07/img_8986.png',
				'https://i.pinimg.com/564x/a3/46/2d/a3462dee75d0ec3c2c90be4e05f43cb9.jpg',
			],
			flowerSize: '120',
			isFlowering: true,
			desc: 'Лимонне дерево — це унікальна кімнатна рослина, яка не тільки прикрашає ваш простір, але й може давати плоди. Ця рослина славиться своїми ароматними жовтими лимонами і красивими зеленими листям. Лимонне дерево також додає свіжість і природний шарм до інтер’єру, роблячи його чудовим вибором для тих, хто любить садівництво.',
			conditionsСare:
				'Лимонне дерево потребує яскравого сонячного світла, тому розмістіть його біля вікна. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Оптимальна температура для росту — +20...+25 °C. Взимку рослина може потребувати зниження температури до +15 °C. Лимонне дерево також виграє від регулярного підживлення органічними добривами під час вегетаційного періоду.',
			soilType:
				'Лимонне дерево з плодами потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для лимонного дерева становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 8 годин освітлення на день.',
			humidityLevel:
				'Лимонне дерево полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
		},

		31: {
			id: 310,
			name: 'Лаймове Дерево',
			price: '2200',
			img: [
				'https://cdn.27.ua/sc--media--prod/default/7f/a2/2e/7fa22e51-da6a-4a78-b997-a7cb25685da3.jpg',
				'https://i.pinimg.com/564x/75/aa/d3/75aad3070683208423afd8583d31b672.jpg',
				'https://i.pinimg.com/564x/1a/34/67/1a3467a6d1387478f303ad4c70cc78a1.jpg',
			],
			flowerSize: '70',
			desc: 'Лаймове дерево Citrus Lime — це чудова кімнатна рослина, яка не тільки вражає своїм декоративним виглядом, але й приносить смачні плоди. Лаймове дерево має яскраві зелені листя і ароматні білі квіти, що робить його популярним серед садівників. Ця рослина додає свіжість і тропічний шарм до будь-якого інтер’єру.',
			conditionsСare:
				'Лаймове дерево потребує яскравого сонячного світла, тому розмістіть його на південному або західному вікні. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи перезволоження. Оптимальна температура для росту — +20...+25 °C. Взимку температура може бути трохи нижчою, близько +15 °C. Лаймове дерево також потребує підживлення органічними добривами в період активного росту для забезпечення належного розвитку і плодоносіння.',
			soilType:
				'Лаймове дерево Citrus Lime потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для лаймового дерева становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 8 годин освітлення на день.',
			humidityLevel:
				'Лаймове дерево полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
			status: 'Топ продажів',
		},
		32: {
			id: 320,
			name: 'Цісус Підвісний Mandaiana',
			price: '800',
			img: [
				'https://fleurplants.com.ua/image/cache/catalog/catalog/plants-to-1m/cissus-fp/cissus-fp-2-1200x800.jpg',
				'https://static.tildacdn.com/tild3438-6633-4230-b161-623362616164/6-47-700x511.jpg',
				'https://zvety.com/wp-content/uploads/cissus-640x480.jpg',
			],
			flowerSize: '60',
			isFlowering: false,
			desc: 'Цісус Mandaiana — це вражаюча ампельна рослина, яка славиться своїм декоративним виглядом і швидким ростом. Її зелена листя має характерну форму і створює пишну завісу, що робить цю рослину ідеальною для підвісних горщиків. Цісус є відмінним вибором для тих, хто хоче додати зелений акцент у свій інтер’єр.',
			conditionsСare:
				"Цісус потребує яскравого, але розсіяного світла для оптимального росту. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити. Цісус не потребує частого підживлення, але можна використовувати рідкі добрива для кімнатних рослин у період активного росту, щоб підтримувати його здоров'я та красу.",
			soilType:
				'Цісус Підвісний Mandaiana потребує добре дренованого, легкого ґрунту, що містить органічні речовини та пісок.',
			temperature:
				'Оптимальна температура для цісуса становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може витримувати легке затінення.',
			humidityLevel:
				'Цісус полюбляє високу вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Розпродаж',
		},

		33: {
			id: 330,
			name: 'Цитрус Каламондін з Плодами',
			price: '2700',
			img: [
				'https://plantsroom.com.ua/wp-content/uploads/2024/06/img_7694.png',
				'https://i.pinimg.com/564x/0a/18/b8/0a18b8591069e6d93c1e35c4d75b2a04.jpg',
				'https://i.pinimg.com/564x/9e/8c/46/9e8c46ff3d9c46cab2f1e8b1ba579775.jpg',
			],
			flowerSize: '130',
			desc: 'Цитрус Каламондін — це декоративна кімнатна рослина, яка вражає своїми маленькими, ароматними плодами і пишною зеленню. Ця рослина має компактну форму, що робить її ідеальною для вирощування в горщиках. Каламондін не лише прикрашає інтер’єр, але й приносить плоди, які можна використовувати в кулінарії.',
			conditionsСare:
				'Каламондін потребує яскравого, розсіяного світла, тому розмістіть його біля вікна. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Оптимальна температура для росту — +20...+25 °C. Взимку рослина може витримувати трохи нижчу температуру, близько +15 °C. Для забезпечення належного розвитку і плодоносіння каламондін потребує регулярного підживлення органічними добривами в період активного росту.',
			soilType:
				'Цитрус Каламондін на стовбурі з плодами потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для каламондіну становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 8 годин освітлення на день.',
			humidityLevel:
				'Каламондін полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
			status: 'Новинки',
		},
		34: {
			id: 340,
			name: 'Цитрус Мандарин',
			price: '2400',
			img: [
				'https://kvitosvit.com.ua/2041/mandarin-kimnatnij-abkhazkij.jpg',
				'https://i.pinimg.com/564x/19/d6/74/19d67425ff1beb418ae89c25f0d7c56e.jpg',
				'https://i.pinimg.com/564x/e2/25/a4/e225a4a8be1fb6770353c2db17a54257.jpg',
			],
			flowerSize: '100',
			isFlowering: true,
			desc: 'Цитрус Мандарин — це популярна кімнатна рослина, яка не тільки прикрашає ваш простір, але й може приносити смачні плоди. Мандаринове дерево має красиві, темно-зелені листя та ароматні білі квіти, що робить його чудовим акцентом у будь-якому інтер’єрі. Ця рослина також відома своїми смачними, соковитими плодами, які радують своїм смаком.',
			conditionsСare:
				'Мандарин потребує яскравого, сонячного світла, тому розмістіть його на південному або західному вікні. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Оптимальна температура для росту — +20...+25 °C. Взимку температура може бути трохи нижчою, близько +15 °C. Для активного росту і плодоносіння мандарин потребує регулярного підживлення органічними добривами.',
			soilType:
				'Цитрус Мандарин потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для мандарину становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 8 годин освітлення на день.',
			humidityLevel:
				'Мандарин полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
			status: 'Новинки',
		},
	},
	'Екзотичні кімнатні рослини': {
		60: {
			id: 600,
			name: 'Банан кімнатний ',
			price: 1500,
			img: [
				'https://i.pinimg.com/564x/2b/98/e8/2b98e8ea9c3a15556eb5a79e9d435e37.jpg',
				'https://i.pinimg.com/564x/89/36/d4/8936d4c869e50d48ad1f2aa277656a4a.jpg',
				'https://i.pinimg.com/564x/2b/b3/79/2bb3797e61a74ffc7a8ba33a57c4e809.jpg',
			],
			flowerSize: '21',
			desc: "Банан кімнатний- це компактна рослина, яка відрізняється невеликими розмірами і привабливим виглядом. Цей плодовий банан ідеально підходить для домашнього вирощування, адже при належному догляді може давати невеликі, але смачні плоди. Рослина має зелене листя, що додає свіжості вашому інтер'єру. Догляд за ним не є складним: потрібно забезпечити достатнє освітлення і регулярний полив.",
			conditionsСare:
				'Банан кімнатний потребує яскравого, розсіяного світла, помірного поливу та родючого субстрату для оптимального росту та розвитку.',
			soilType:
				'Банан кімнатний  потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для кімнатного банана становить від 22°C до 28°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може переносити легке затінення.',
			humidityLevel:
				'Кімнатний банан полюбляє високу вологість, тому регулярне обприскування листя та підтримання вологості повітря будуть корисними.',
		},
		61: {
			id: 610,
			name: 'Мірт домашній Гостролистий',
			price: 1800,
			img: [
				'https://cdn.27.ua/sc--media--prod/default/54/67/fb/5467fb24-8ce1-439f-a4db-eedce98acacc.jpeg',
				'https://i.pinimg.com/564x/fc/df/96/fcdf961be43cf4bf1559be18c51e6501.jpg',
				'https://i.pinimg.com/564x/e1/40/21/e1402102b7bfd5e174b50a541d4388b0.jpg',
			],
			desc: "Мірт домашній Гостролистий - це елегантна кімнатна рослина, відома своїм ароматним листям та витонченими квітами. Ця рослина не тільки прикрашає інтер'єр, але й має корисні властивості, адже мірт часто використовується в ароматерапії. Гостролистий мірт відрізняється щільними, темно-зеленими листками і здатний рости до 30 см у висоту. Догляд за ним включає регулярний полив та яскраве, розсіяне освітлення.",
			conditionsСare:
				"Мірт домашній Гостролистий потребує яскравого, розсіяного світла, помірного поливу та родючого субстрату, щоб підтримувати своє здоров'я та красу.",
			soilType:
				'Мірт домашній Гостролистий потребує добре дренованого, легкого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для мірту становить від 15°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, але може витримувати легке затінення.',
			humidityLevel:
				'Мірт полюбляє помірну вологість, тому регулярне обприскування листя буде корисним.',
		},
		62: {
			id: 620,
			name: 'Ананас Вікторія до 10 см',
			price: 1200,
			img: [
				'https://faterra.com/img/banner/ananas.jpg',
				'https://i.pinimg.com/564x/d8/d4/d8/d8d4d80ecfe24825a71f95bdb75be325.jpg',
				'https://yaskravaklumba.com.ua/image/cache/catalog/komnatnye/ananas/ananaskomnatnyj1-500x500.jpg',
			],
			flowerSize: '50',
			desc: 'Ананас Вікторія - це компактна кімнатна рослина, відома своїм привабливим виглядом та смачними плодами. Ця рослина досягає висоти до 10 см і має яскраво-зелене листя, що створює екзотичну атмосферу у вашому домі. При належному догляді ананас може давати невеликі плоди, що є великою перевагою для любителів кімнатних рослин. Догляд за ананасом Вікторія включає регулярний полив і яскраве, розсіяне світло.',
			conditionsСare:
				"Ананас Вікторія потребує яскравого, розсіяного світла, помірного поливу та добре дренованого субстрату для підтримання здоров'я рослини.",
			soilType:
				'Ананас Вікторія потребує добре дренованого, легкого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для ананаса становить від 20°C до 30°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 6 годин освітлення на день.',
			humidityLevel:
				'Ананас полюбляє високу вологість, тому регулярне обприскування листя та підтримання вологості повітря будуть корисними.',
		},
		63: {
			id: 630,
			name: 'Лімонелла сорт Пурш',
			price: 1600,
			img: [
				'https://cdn.27.ua/sc--media--prod/default/e8/63/d5/e863d5fc-bf6b-42fb-a408-a708adcd9e05.jpeg',
				'https://i.pinimg.com/564x/fc/f1/c6/fcf1c6cfc84681e84fdc9a660f0c3688.jpg',
				'https://i.pinimg.com/564x/60/56/1b/60561bf56bf87812b169a3ce5a4d65b6.jpg',
			],
			flowerSize: '100',
			desc: 'Лімонелла сорт Пурша - це компактна кімнатна рослина, відома своїм цитрусовим ароматом та невеликими розмірами, що становлять від 11 до 20 см. Ця рослина має зелене листя і маленькі квіти, які можуть давати смачні плоди. Лімонелла є чудовим вибором для тих, хто хоче мати свіжий цитрусовий аромат у домі, а також насолоджуватися натуральними плодами. Догляд за нею включає яскраве, розсіяне світло та помірний полив.',
			conditionsСare:
				'Лімонелла сорт Пурша потребує яскравого, розсіяного світла, помірного поливу та родючого субстрату для забезпечення здорового росту та плодоношення.',
			soilType:
				'Лімонелла сорт Пурша потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для лімонелли становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 8 годин освітлення на день.',
			humidityLevel:
				'Лімонелла полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
		},
		64: {
			id: 640,
			name: 'Фейхоа Звичайний 21-30 см',
			price: 1900,
			img: [
				'https://i.pinimg.com/564x/d9/7b/cd/d97bcd0cc0e660d2f6d7f30a6deff799.jpg',
				'https://i.pinimg.com/564x/e1/95/f6/e195f68959a3e3bb015c5cef4ab49c18.jpg',
				'https://i.pinimg.com/564x/42/7c/95/427c95927d486b7a984b60e45e1c564a.jpg',
			],
			flowerSize: '90',
			desc: 'Фейхоа Звичайний - це декоративна кімнатна рослина з привабливими зеленими листками та білими квітами, що цвітуть навесні. Рослина досягає висоти від 21 до 30 см і відома своїми смачними плодами, що мають унікальний аромат і смак. Фейхоа є ідеальним вибором для кімнатного вирощування, адже при належному догляді може давати плоди. Догляд за цією рослиною включає яскраве, розсіяне світло та помірний полив.',
			conditionsСare:
				'Фейхоа Звичайний потребує яскравого, розсіяного світла, регулярного помірного поливу та родючого субстрату для оптимального росту і плодоношення.',
			soilType:
				'Фейхоа Звичайний потребує добре дренованого, родючого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для фейхоа становить від 15°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 6 годин освітлення на день.',
			humidityLevel:
				'Фейхоа полюбляє помірну вологість, тому регулярний полив та обприскування листя будуть корисними.',
		},
		65: {
			id: 650,
			name: 'Розмарин',
			price: 1200,
			img: [
				'https://cactus.by/sites/default/files/products/img_9788.jpg',
				'https://i.pinimg.com/control/564x/05/45/e2/0545e28f9a6b91773b685ebd20f0cdd3.jpg',
				'https://i.pinimg.com/control/564x/a1/c8/46/a1c84625bd6ab3639aa3cf2e56617b2b.jpg',
			],
			flowerSize: '40',
			desc: "Розмарин - це ароматична кімнатна рослина висотою від 11 до 20 см, відома своїм яскравим смаком і ароматом, що робить його популярним у кулінарії. Рослина має вузьке зелене листя і може цвісти невеликими блакитними або фіолетовими квітами. Розмарин є чудовим доповненням до будь-якого інтер'єру, додаючи свіжість і природний вигляд. Догляд за розмарином простий: він потребує яскравого, сонячного світла і помірного поливу.",
			conditionsСare:
				'Розмарин потребує яскравого сонячного світла, помірного поливу та добре дренованого субстрату для забезпечення здорового росту.',
			soilType:
				'Розмарин потребує добре дренованого, легкого ґрунту, що містить піщані або гравійні компоненти.',
			temperature:
				'Оптимальна температура для розмарину становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 6 годин освітлення на день.',
			humidityLevel:
				'Розмарин не потребує високої вологості і краще росте в сухих умовах, тому полив слід здійснювати помірно.',
			status: 'Новинки',
		},
	},
	Флораріуми: {
		70: {
			id: 700,
			name: 'Флораріум з орхідеєю',
			price: 3000,
			img: 'https://plantsroom.com.ua/wp-content/uploads/2024/06/img_6864-scaled.jpg',
			flowerSize: '40',
			isFlowering: true,
			desc: "Флораріум з орхідеєю в куполі Красуня - це елегантна композиція, що об'єднує природу і сучасний дизайн. Заввишки 40 см, цей флораріум містить яскраву орхідею, що привертає увагу своїми розкішними квітами. Купольна форма створює оптимальні умови для росту рослини, захищаючи її від зовнішнього впливу. Це ідеальний вибір для декорування дому або офісу, додаючи нотку елегантності та стилю. Догляд за флораріумом полягає в забезпеченні яскравого, розсіяного світла та регулярному поливі.",
			conditionsСare:
				"Флораріум з орхідеєю потребує яскравого, розсіяного освітлення, помірного поливу та ретельного контролю вологості для підтримки здоров'я рослини.",
			soilType:
				'Флораріум з орхідеєю в куполі потребує спеціального субстрату для орхідей, який забезпечує хороший дренаж і повітропроникність.',
			temperature:
				'Оптимальна температура для орхідеї становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати флораріум на місці з хорошим освітленням.',
			humidityLevel:
				'Орхідея полюбляє високу вологість, тому регулярне обприскування листя та підтримання вологості повітря будуть корисними.',
			status: 'Топ продажів',
		},
		71: {
			id: 710,
			name: 'Флораріум з деревом Бонсаєм',
			price: 2500,
			img: 'https://cdn.27.ua/sc--media--prod/default/f3/32/dc/f332dcd4-bc3d-4779-8129-4b3dc4b13bb4.jpg',
			flowerSize: '12',
			desc: "Флораріум з деревом Бонсаєм Magic Gardens - це стильна і унікальна композиція розміром 25х12 см, яка чудово підійде для будь-якого інтер'єру. Це дерево Бонсаєм, вирощене в спеціальному флораріумі, додає нотку спокою та природної краси вашому простору. Бонсаї відомі своєю естетичною привабливістю та вимагають мінімального догляду, що робить їх ідеальним вибором для зайнятих людей. Догляд за флораріумом полягає в забезпеченні яскравого, розсіяного світла та помірного поливу.",
			conditionsСare:
				"Флораріум з деревом Бонсаєм потребує яскравого, розсіяного освітлення, помірного поливу та хорошого дренажу для підтримки здоров'я рослини.",
			soilType:
				'Флораріум з деревом Бонсаєм потребує добре дренованого ґрунту, збагаченого органічними речовинами, що забезпечує хорошу аерацію коренів.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому краще розміщувати флораріум на місці з хорошим освітленням.',
			humidityLevel:
				'Бонсай полюбляє помірну вологість, тому регулярне обприскування листя та контроль за вологістю повітря будуть корисними.',
		},
		72: {
			id: 720,
			name: 'Флораріум з сукулентами',
			price: 1800,
			img: 'https://content.rozetka.com.ua/goods/images/big/413568670.jpg',
			flowerSize: '10',
			isFlowering: false,
			desc: "Флораріум з сукулентами та імітацією водойми - це компактна композиція заввишки 10 см, що привносить елементи природи у ваш дім. Сукуленти, відомі своєю витривалістю та низькими вимогами до догляду, чудово поєднуються з імітацією водойми, створюючи стильний та заспокійливий вигляд. Ця рослина ідеально підходить для тих, хто хоче додати зелень до інтер'єру без зайвих турбот. Догляд за флораріумом передбачає яскраве, розсіяне світло та помірний полив.",
			conditionsСare:
				"Флораріум з сукулентами потребує яскравого, розсіяного освітлення, помірного поливу та дренажу для забезпечення здоров'я рослин.",
			soilType:
				'Флораріум з сукулентами потребує добре дренованого ґрунту, збагаченого піском або перлітом, щоб запобігти застою води.',
			temperature:
				'Оптимальна температура для сукулентів становить від 20°C до 30°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому сонячному світлу і потребує не менше 6 годин освітлення на день.',
			humidityLevel:
				'Сукуленти не потребують високої вологості і краще ростуть в сухих умовах, тому полив слід здійснювати помірно.',
		},
		73: {
			id: 730,
			name: 'Флораріум з орхідеєю',
			price: 3000,
			img: 'https://static.tildacdn.com/tild6536-3464-4666-b930-656235633832/17044151422131.jpg',
			flowerSize: '40',
			isFlowering: true,
			desc: 'Флораріум з орхідеєю в куполі Красуня - це елегантна композиція, що поєднує в собі красу орхідеї та сучасний дизайн. Висотою 40 см, цей флораріум містить яскраву орхідею, яка привертає увагу своїми розкішними квітами. Купольна форма забезпечує оптимальні умови для росту рослини, захищаючи її від зовнішнього впливу. Це ідеальний вибір для декорування вашого дому або офісу, додаючи нотку елегантності та стилю. Догляд за флораріумом включає яскраве, розсіяне світло та помірний полив.',
			conditionsСare:
				"Флораріум з орхідеєю потребує яскравого, розсіяного освітлення, помірного поливу та ретельного контролю вологості для підтримки здоров'я рослини.",
			soilType:
				'Флораріум з орхідеєю в куполі потребує спеціального субстрату для орхідей, який забезпечує хороший дренаж і повітропроникність.',
			temperature:
				'Оптимальна температура для орхідеї становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати флораріум на місці з хорошим освітленням.',
			humidityLevel:
				'Орхідея полюбляє високу вологість, тому регулярне обприскування листя та підтримання вологості повітря будуть корисними.',
			status: 'Топ продажів',
		},
		74: {
			id: 740,
			name: 'Міні-флораріум Крапля',
			price: 800,
			img: 'https://shop-cdn1-2.vigbo.tech/shops/32378/products/22107493/images/2-d9b974d2bfe689c36e92c076e74ecc93.jpeg',
			flowerSize: '9',
			isFlowering: false,
			desc: 'Міні-флораріум Крапля - це компактна і стильна композиція розміром 9х9 см, що ідеально підходить для прикрашання вашого простору. Цей міні-флораріум містить різноманітні сукуленти або маленькі рослини, які потребують мінімального догляду. Його унікальна форма нагадує краплю, додаючи нотку елегантності. Це ідеальний вибір для столу або підвіконня, де рослини можуть отримувати достатньо світла. Догляд за міні-флораріумом передбачає яскраве, розсіяне світло та помірний полив.',
			conditionsСare:
				'Міні-флораріум Крапля потребує яскравого, розсіяного освітлення, помірного поливу та дренажу для здорового росту рослин.',
			soilType:
				'Міні-флораріум Крапля потребує добре дренованого ґрунту, збагаченого перлітом або піском для забезпечення аерації коренів.',
			temperature:
				'Оптимальна температура для рослин у флораріумі становить від 18°C до 24°C.',
			lightRequirement:
				'Рослини віддають перевагу яскравому, непрямому світлу, тому рекомендується розміщувати флораріум на місці з хорошим освітленням.',
			humidityLevel:
				'Міні-флораріум потребує помірної вологості, тому регулярне обприскування листя та контроль за вологістю повітря будуть корисними.',
		},
		75: {
			id: 38,
			name: 'Флораріум з орхідеєю',
			price: 3500,
			img: 'https://static.tildacdn.com/tild3539-3134-4639-b936-316636646131/4H1A7585-min.jpg',
			flowerSize: '52',
			isFlowering: true,
			desc: "Флораріум з орхідеєю - це розкішна композиція, яка стане яскравим акцентом у вашому інтер'єрі. Висотою 52 см, цей флораріум містить елегантну орхідею, яка привертає увагу своїми яскравими квітами та витонченими формами. Простора купольна конструкція забезпечує оптимальні умови для росту рослини, створюючи ідеальний мікроклімат. Це відмінний вибір для тих, хто шукає стильний елемент декору для дому чи офісу. Догляд за флораріумом включає яскраве, розсіяне світло та регулярний помірний полив.",
			conditionsСare:
				"Флораріум з орхідеєю потребує яскравого, розсіяного освітлення, помірного поливу та контролю вологості для підтримки здоров'я рослини.",
			soilType:
				'Флораріум з орхідеєю потребує спеціального субстрату для орхідей, що забезпечує хороший дренаж і повітропроникність.',
			temperature:
				'Оптимальна температура для орхідеї становить від 20°C до 25°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому флораріум слід розміщувати на місці з добрим освітленням.',
			humidityLevel:
				'Орхідея полюбляє високу вологість, тому регулярне обприскування листя та підтримання вологості повітря буде корисним.',
		},
	},
	Бонсай: {
		35: {
			id: 350,
			name: 'Бонсай на камені',
			price: '3200',
			img: 'https://magicgardens.com.ua/wp-content/uploads/2024/06/IMG_6246.jpg',
			flowerSize: '50',
			isFlowering: false,
			desc: 'Бонсай на камені — це унікальна композиція зі стабілізованих рослин, яка поєднує в собі природну красу і сучасні дизайнерські рішення. Стабілізовані рослини не потребують поливу і догляду, зберігаючи свій вигляд протягом тривалого часу. Цей бонсай — це стильна декоративна прикраса для дому чи офісу, яка створює атмосферу спокою та гармонії.',
			conditionsСare:
				'Оскільки рослини стабілізовані, вони не потребують поливу, освітлення або добрив. Їх слід тримати подалі від прямих сонячних променів і не піддавати впливу високої вологості. Ідеальна температура для збереження стабілізованих рослин — кімнатна, від +18 до +24 °C. Ця композиція є повністю автономною і не вимагає активного догляду.',
			soilType:
				'Бонсай на камені Magic Gardens потребує спеціального субстрату для бонсаїв, який забезпечує хорошу аерацію коренів і дренаж.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати бонсай на місці з хорошим освітленням.',
			humidityLevel:
				'Бонсай з стабілізованими рослинами не потребує високої вологості, але регулярне обприскування може покращити загальний стан рослин.',
			status: 'Топ продажів',
		},

		36: {
			id: 360,
			name: 'Бонсай над водоспадом',
			price: '3500',
			img: 'https://cdn.27.ua/sc--media--prod/default/2b/a4/25/2ba425d4-43d0-4df0-952c-1bf16dd2c7d0.jpg',
			flowerSize: '60',
			isFlowering: false,
			desc: 'Бонсай над водоспадом — це вражаюча композиція, яка поєднує в собі красу стабілізованих рослин і елементи водоспаду. Ця декоративна рослина створює атмосферу спокою та гармонії, роблячи будь-який простір більш затишним. Завдяки стабілізованим рослинам, бонсай зберігає свій природний вигляд без потреби в постійному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Їх слід зберігати в приміщенні з кімнатною температурою, уникаючи прямих сонячних променів і високої вологості. Оптимальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді, що є чудовим варіантом для будь-якого інтер’єру.',
			soilType:
				'Бонсай над водоспадом Magic Garden потребує легкого, добре дренованого ґрунту, що дозволяє воді легко проходити через корені.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати бонсай на місці з хорошим освітленням.',
			humidityLevel:
				'Бонсай полюбляє помірну вологість, тому регулярне обприскування листя та контроль за вологістю повітря будуть корисними.',
			status: 'Розпродаж',
		},
		37: {
			id: 370,
			name: 'Фікус Бонсай Мікрокарпа',
			price: '1500',
			img: 'https://i.pinimg.com/564x/9d/dc/a1/9ddca1efd842f33cdeca6346b158404b.jpg',
			flowerSize: '30',
			isFlowering: false,
			desc: 'Фікус Бонсай Мікрокарпа — це елегантна і стильна кімнатна рослина, яка славиться своїми маленькими, глянцевими листочками і характерною формою стовбура. Ця рослина ідеально підходить для створення бонсай-композицій завдяки своїй здатності легко формуватися і піддаватися обрізанню. Фікус Мікрокарпа додасть витонченості та природної краси до будь-якого інтер’єру.',
			conditionsСare:
				'Фікус Мікрокарпа потребує яскравого, розсіяного світла, але може витримувати і часткову тінь. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку слід уникати холодних протягів і забезпечувати рослині достатню вологість. Регулярне підживлення органічними добривами сприяє здоровому росту та розвитку рослини.',
			soilType:
				'Фікус Бонсай Мікрокарпа потребує добре дренованого, легкого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для фікуса становить від 20°C до 26°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, хоча може витримувати і легке затінення.',
			humidityLevel:
				'Фікус Бонсай Мікрокарпа полюбляє підвищену вологість, тому регулярне обприскування листя буде корисним.',
			status: 'Новинки',
		},
		38: {
			id: 380,
			name: 'Бонсай Magic Gardens',
			price: '1800',
			img: 'https://magicgardens.com.ua/wp-content/uploads/2023/04/IMG_8729.jpg',
			flowerSize: '20',
			desc: 'Бонсай Magic Gardens — це стильна і елегантна композиція, яка додасть вишуканості будь-якому інтер’єру. Завдяки своїй компактній формі і натуральному вигляду, цей бонсай стане чудовим акцентом на столі або підвіконні. Рослина вимагає мінімального догляду, що робить її ідеальним вибором для зайнятих людей.',
			conditionsСare:
				'Цей бонсай не потребує поливу, оскільки виготовлений з стабілізованих рослин. Рекомендується тримати його в приміщенні з кімнатною температурою, уникати прямих сонячних променів та високої вологості. Оптимальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді та ідеальним вибором для будь-якого простору.',
			soilType:
				'Бонсай Magic Gardens потребує легкого, добре дренованого ґрунту, збагаченого органічними речовинами.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати бонсай на місці з хорошим освітленням.',
			humidityLevel:
				'Бонсай полюбляє помірну вологість, тому регулярне обприскування листя та контроль за вологістю повітря будуть корисними.',
		},
		39: {
			id: 390,
			name: 'Мосаріум Бонсай',
			price: '2500',
			img: 'https://cdn.27.ua/sc--media--prod/default/85/d0/cc/85d0cc35-b654-405e-b2d8-3afc86ff338a.jpg',
			flowerSize: '25',
			isFlowering: false,
			desc: 'Мосаріум Бонсай — це вражаюча композиція, яка поєднує стабілізовані рослини в елегантному дизайні. Ця рослина створює затишну атмосферу в будь-якому інтер’єрі, надаючи йому нотку природності та естетики. Завдяки стабілізованим рослинам, бонсай зберігає свій вигляд без потреби в регулярному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Рекомендується тримати мосаріум в кімнатній температурі, уникаючи прямих сонячних променів і високої вологості. Ідеальна температура для збереження композиції — від +18 до +24 °C. Це робить мосаріум легким у догляді та ідеальним для будь-якого простору.',
			soilType:
				'Мосаріум Бонсай зі стабілізованими рослинами Сад імператора потребує спеціального субстрату для бонсаїв, який забезпечує хороший дренаж і аерацію коренів.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина віддає перевагу яскравому, непрямому світлу, тому рекомендується розміщувати мосаріум на місці з хорошим освітленням.',
			humidityLevel:
				'Бонсай зі стабілізованими рослинами не потребує високої вологості, але регулярне обприскування може покращити загальний стан рослин.',
		},
		40: {
			id: 400,
			name: 'Бонсай в банці Magic',
			price: '2000',
			img: 'https://cdn.27.ua/sc--media--prod/default/0d/aa/52/0daa5283-180e-4106-a601-7cba2bc93707.jpg',
			flowerSize: '12',
			isFlowering: false,
			desc: 'Бонсай в банці Magic — це унікальна декоративна композиція, яка поєднує в собі елегантність бонсая та стиль баночки. Ця рослина стане чудовим акцентом у вашому інтер’єрі, додаючи нотку природності та затишку. Завдяки стабілізованим рослинам, бонсай зберігає свій вигляд без потреби в регулярному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Рекомендується розміщувати бонсай у кімнаті з нормальною температурою, уникаючи прямих сонячних променів і високої вологості. Ідеальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді та ідеальним вибором для будь-якого простору.',
			soilType:
				'Бонсай в банці Magic Gardens потребує добре дренованого субстрату для бонсаїв, що забезпечує кореням достатньо повітря.',
			temperature:
				'Оптимальна температура для бонсаю становить від 18°C до 24°C.',
			lightRequirement:
				'Рослина потребує яскравого, непрямого світла, тому розташування в місці з гарним освітленням буде оптимальним.',
			humidityLevel:
				'Бонсай в банці потребує помірної вологості, тому регулярне обприскування листя та контроль за вологістю повітря допоможуть підтримати здоровий стан рослини.',
			status: 'Топ продажів',
		},
	},
};

app.get('/', (req, res) => {
	res.send('Welcome to the Plant API! Use /plants to see the list of plants.');
});

// Обробник для маршруту /plants
app.get('/plants', (req, res) => {
	res.json(plants);
});

// Обробник для отримання списку рослин за категорією
app.get('/plants/:category', (req, res) => {
	const category = req.params.category;
	const categoryPlants = plants[category];

	if (categoryPlants) {
		res.json(categoryPlants);
	} else {
		res.status(404).json({ message: 'Category not found' });
	}
});

app.get('/plants/id/:id', (req, res) => {
	const id = parseInt(req.params.id); // Перетворюємо ID на число
	let foundPlant = null;

	// Шукаємо по всіх категоріях
	for (const category in plants) {
		const categoryPlants = plants[category]; // Отримуємо рослини в категорії
		// Шукаємо рослину з відповідним ID
		for (const plantId in categoryPlants) {
			if (categoryPlants[plantId].id === id) {
				foundPlant = categoryPlants[plantId]; // Зберігаємо знайдену рослину
				break; // Виходимо з внутрішнього циклу
			}
		}
		if (foundPlant) break; // Виходимо з зовнішнього циклу, якщо рослина знайдена
	}

	if (foundPlant) {
		res.json(foundPlant); // Повертаємо знайдену рослину у форматі JSON
	} else {
		res.status(404).json({ message: 'Plant not found' }); // Повертаємо помилку 404, якщо не знайшли рослину
	}
});

// Обробник для отримання всіх категорій
app.get('/plants/categories', (req, res) => {
	console.log('GET /plants/categories was called');
	const categories = Object.keys(plants);
	res.json(categories);
});
// Запуск сервера
app.listen(port, () => {
	console.log(`Server running at http://localhost:${port}`);
});
