const express = require('express');
const cors = require('cors'); // Імпортуємо cors
const app = express();
const port = process.env.PORT || 3000;

app.use(cors()); // Додаємо middleware для CORS
app.use(express.json());

const plants = {
	Orchidaceae: {
		0: {
			name: 'Дендробіум',
			price: 500,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/49/2d/1200x1200/ce67be92_6475f990b5b9d.JPG',
			flowerSize: '50',
			isFlowering: true,
			desc: 'це один з найпопулярніших родів орхідей, що налічує понад 1800 видів. Ці вражаючі рослини відомі своїм різноманіттям форм, кольорів та розмірів. Вони можуть мати стебла від коротких до довгих, а квіти — від маленьких до великих, зазвичай з яскравими і насиченими кольорами: від білого до рожевого, жовтого, фіолетового та навіть синього.',
			conditionsСare:
				'потребує яскравого, розсіяного освітлення і регулярного поливу, але слід уникати перезволоження. Рослина краще росте в спеціалізованому субстраті для орхідей, який забезпечує добру аерацію коренів. Підживлюйте її під час активного росту, використовуючи добрива для орхідей, щоб підтримувати здоров’я та рясне цвітіння.',
			light: true,
			temperature: '+18...+25',
			watering: 'помірний',
		},
		1: {
			name: 'Фаленопсис Біла Королівська',
			price: 700,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/5a/70/1200x1200/d96150a4_6358e68ec09cd.JPG',
			flowerSize: '70',
			isFlowering: true,
			desc: 'це царські квіти, які є дуже популярними серед квітникарів. Незважаючи на те, що королівська орхідея вважається більш вимогливою, ніж звичайна, з доглядом за нею справиться навіть новачок.Королівські орхідеї досить високі, мають великі квіти та тривале цвітіння, яке на 1-2 місяці довше, ніж у звичайних орхідей. У діаметрі квітки можуть досягати 20 см. А забарвлення буває абсолютно різне: білі, рожеві, в цятку, в смужку, фіолетові та багато інших. ',
			conditionsСare:
				'Для довгого цвітіння орхідеям потрібно багато світла. Ідеальні умови для них в місцях куди сонце потрапляє на декілька годин в день (зранку чи ввечері)',
			light: true,
			temperature: '+15...+30',
			watering: 'помірний',
		},
		2: {
			name: 'Міні орхідея мікс в кашпо',
			price: 2000,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/74/ea/1200x1200/28ea8b7_6066ee212b9ea.JPG',
			flowerSize: '35',
			isFlowering: true,
			desc: " це вишукана композиція з різних видів мініатюрних орхідей, представлених у стильному кашпо. Ці рослини відзначаються компактними розмірами, яскравими кольорами та елегантними формами, що робить їх ідеальними для прикраси будь-якого інтер'єру. Догляд за міні орхідеями простий: вони потребують яскравого, розсіяного світла і помірного поливу. Ця композиція додасть затишку і витонченості у ваш дім або офіс! ",
			conditionsСare:
				'Міні орхідея мікс потребує яскравого, розсіяного освітлення, помірного поливу і спеціалізованого субстрату для орхідей для підтримання здоров’я та цвітіння.',
			light: true,
			temperature: '+18...+25',
			watering: 'помірний',
		},
	},
	Foliage: {
		3: {
			name: 'Хамедорея',
			price: 500,
			img: 'https://polysad.com/media/cache/article_huge/chamaedorea1-660ec190e06af046980317.jpg.jpeg',
			flowerSize: '100',
			isFlowering: false,
			desc: ' це рід пальм, що включає різні види, висота яких може варіюватися. Зазвичай, вони досягають висоти від 1 до 3 метрів, в залежності від конкретного виду. Наприклад, Хамедорея елеганс (Chamaedorea elegans) зазвичай має висоту близько 1-1.5 метра.',
			conditionsСare:
				'Хамедорея потребує яскравого, розсіяного світла, помірного поливу з підсиханням верхнього шару ґрунту, високої вологості повітря, легкого дренованого субстрату та підживлення рідким добривом під час активного росту',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		4: {
			name: 'Фікус Лірата Бамбіно',
			price: 630,
			img: 'https://cdn.27.ua/sc--media--prod/default/e3/72/dc/e372dcdd-4cec-4c6e-90a2-bb1b9062f963.jpeg',
			flowerSize: '45',
			isFlowering: false,
			desc: "це компактна декоративно-листяна рослина з великими, вражаючими листками, які мають характерну хвилясту форму. Ця рослина додає елегантності будь-якому інтер'єру завдяки своїй пишній зелені і стрункій формі",
			conditionsСare:
				'потребує яскравого, розсіяного освітлення та помірного поливу, дозволяючи верхньому шару ґрунту підсохнути між поливами. Рекомендується регулярно обприскувати листя, щоб підтримувати необхідну вологість.',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		5: {
			name: 'Кротон Екселент',
			price: '749',
			img: 'https://flowers.ua/images/Flowers/articles/293-img-1.jpg',
			flowerSize: '70',
			isFlowering: false,
			desc: "це яскрава декоративно-листяна рослина, відома своїми великими, різнокольоровими листками, які мають насичені жовті, червоні та зелені відтінки. Завдяки своїй привабливій формі і кольору, ця рослина стає яскравим акцентом у будь-якому інтер'єрі.",
			conditionsСare:
				'Кротон Екселент потребує яскравого світла для підтримання насиченості кольорів, а полив має бути регулярним, дозволяючи верхньому шару ґрунту підсохнути між поливами. Важливо уникати застою води, щоб запобігти гниттю коренів',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		6: {
			name: 'Заміокулькас',
			price: '1520',
			img: 'https://cdn.asterias.od.ua/images/81/81-2-61-700x700.jpg',
			flowerSize: '75',
			isFlowering: false,
			desc: 'відомий також як "щастя дерева" або "доларове дерево", є стійкою та невибагливою рослиною з глянцевими, темно-зеленими листками, які ростуть на м\'ясистих черешках. Ця рослина популярна завдяки своїй здатності витримувати низьку освітленість і нерегулярний полив, що робить її ідеальним вибором для офісів та житлових приміщень',
			conditionsСare:
				'потребує яскравого, але розсіяного світла, і не вимагає частого поливу — поливайте рослину, коли верхній шар ґрунту повністю підсохне. Важливо використовувати добре дренований ґрунт, щоб уникнути застою води.',
			light: false,
			temperature: '+15...+25',
			watering: 'помірний',
		},
		7: {
			name: 'Фікус Кінкі',
			price: '890',
			img: 'https://galsad.ua/upload/iblock/6fa/kq64rb03txhsvxhbt6ma7ws8dmo5dccp/%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%BD%D1%8F_viber_2023-08-01_13-59-30-720.jpg',
			flowerSize: '50',
			isFlowering: false,
			desc: 'це компактний і декоративний сорт фікуса з маленькими глянцевими зеленими листками з білими або кремовими краями. Він є популярною кімнатною рослиною завдяки своєму вишуканому зовнішньому вигляду і здатності добре рости в домашніх умовах. Його невеликий розмір робить його чудовим вибором для обмежених просторів.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але може переносити і напівтінь. Поливати його варто тоді, коли верхній шар ґрунту підсихає. Уникайте перезволоження ґрунту. Для кращого росту використовуйте добре дренований ґрунт і забезпечте помірну вологість повітря.',
			light: false,
			temperature: '+18...+25',
			watering: 'помірний',
		},
		8: {
			name: 'Монстера',
			price: '1650',
			img: 'https://cdn.asterias.od.ua/images/monstera.jpg',
			flowerSize: '80',
			isFlowering: false,
			desc: "це популярна декоративна рослина, відома своїм екзотичним виглядом і великими, розрізаними листками, які можуть досягати вражаючих розмірів. Її темно-зелені листки мають характерні отвори і рвані краї, що надає їй оригінальний вигляд. Завдяки своїй невибагливості та витривалості, Монстера чудово підходить для вирощування в кімнатних умовах і є фаворитом серед дизайнерів інтер'єрів.', conditionsСare: 'Монстера потребує яскравого, але розсіяного світла, може переносити напівтінь. Поливайте рослину, коли ґрунт зверху підсихає, уникаючи надлишкової вологи. Для кращого росту забезпечте високу вологість і періодично протирайте листки від пилу. Важливо також підпирати рослину, оскільки вона любить витися.",
			light: false,
			temperature: '+18...+30',
			watering: 'помірний',
		},
		9: {
			name: 'Фікус Бенжаміна Екзотіка',
			price: '2440',
			img: 'https://plants.pervaya.com.ua/image/cache/catalog/Komnatnyye_i_ofisnyye_rasteniya/image-catalog-temp-3210367_1-800x800.jpg',
			flowerSize: '150',
			isFlowering: false,
			desc: 'це елегантна кімнатна рослина з витонченими, дрібними, блискучими листками, що надають їй ніжного та розкішного вигляду. Вона відома своєю здатністю очищати повітря, тому популярна в офісах і житлових приміщеннях. Фікус Бенжаміна Екзотіка — це ідеальний вибір для створення затишної атмосфери в інтер’єрі.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але також може рости в напівтіні. Важливо підтримувати рівномірний полив — ґрунт повинен бути злегка вологим, але не перезволоженим. Рослина чутлива до змін умов, тому варто уникати різких коливань температури та протягів.',
			light: false,
			temperature: '+18...+25',
			watering: 'помірний',
		},
		10: {
			name: 'Традесканція Білоквіткова',
			price: '720',
			img: 'https://floralife.com.ua/image/cache/catalog/encyclopedia/tradescantia-enc/tradescantia-enc-top-1200x900.jpg',
			flowerSize: '20',
			isFlowering: true,
			desc: 'це невибаглива декоративна рослина з ніжними білими квітами та довгими, звисаючими стеблами, вкритими зеленими або смугастими листками. Ця рослина відома своєю здатністю швидко рости, утворюючи густі килимки або вишукані каскадні форми, що робить її ідеальним вибором для підвісних горщиків або декоративних композицій.',
			conditionsСare:
				'любить яскраве розсіяне світло, але може витримувати і півтінь. Полив повинен бути регулярним, але не надмірним — ґрунт має бути вологим, але без застою води. Вона добре росте в умовах підвищеної вологості та потребує періодичного обрізання для збереження форми.',
			light: false,
			temperature: '+15...+25',
			watering: 'регулярний',
		},
		4: {
			name: '',
			price: '',
			img: '',
			flowerSize: '45',
			isFlowering: null,
			desc: '',
			conditionsСare: '',
			light: null,
			temperature: '+18...+24',
			watering: 'помірний',
		},
	},
	DecorativeFlorentem: {
		11: {
			name: 'Спатифілум',
			price: '950',
			img: 'https://cdn.asterias.od.ua/images/113/113-3-73-700x598.jpg',
			flowerSize: '50',
			isFlowering: true,
			desc: 'відомий також як "жіноче щастя", — це вічнозелена кімнатна рослина з елегантними білими квітками і блискучими темно-зеленими листками. Він не тільки додає краси приміщенню, але й очищує повітря, що робить його популярним вибором для дому та офісу. Спатифілум відомий своєю невибагливістю та здатністю рости навіть у менш сприятливих умовах.',
			conditionsСare:
				'потребує яскравого розсіяного світла, але може рости й у затінених місцях. Поливати рослину слід регулярно, підтримуючи вологий ґрунт, але не допускаючи застою води. Він також любить підвищену вологість і потребує регулярного обприскування. Чутливий до протягів та різких перепадів температури.',
			light: false,
			temperature: '+18...+27',
			watering: 'регулярний',
		},
		12: {
			name: 'Лаванда Florium Dwarf Blue',
			price: '1350',
			img: 'https://cdn.27.ua/sc--media--prod/default/fb/df/b2/fbdfb2da-09a0-4842-970d-5fe708e5f52e.jpg',
			flowerSize: '30',
			isFlowering: true,
			desc: 'Лаванда Florium Dwarf Blue — це компактний сорт лаванди з інтенсивно синьо-фіолетовими квітками та сріблясто-зеленим листям. Вона відома своїм приємним ароматом, який заспокоює та створює атмосферу затишку. Ця лаванда чудово підходить для вирощування в саду, на балконі чи у кімнатних умовах, а також ідеальна для створення ароматних букетів чи декоративних композицій.',
			conditionsСare:
				'Лаванда потребує яскравого сонячного світла і добре дренованого ґрунту. Полив має бути помірним, особливо слід уникати перезволоження. Ця рослина стійка до посухи, тому поливати її варто лише тоді, коли ґрунт добре підсох. Лаванда полюбляє теплі місця і не переносить надмірну вологість та сильні морози.',
			light: true,
			temperature: '+20...+30',
			watering: 'помірний',
		},
		13: {
			name: 'Азалія Мікс на Штамбі 19/60',
			price: '1850',
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/4c/61/1200x1200/40125776_64749a2718ce1.JPG',
			flowerSize: '60',
			isFlowering: true,
			desc: 'Азалія Мікс на Штамбі — це елегантна кімнатна рослина, яка прикрашена яскравими, пишними квітами різних відтінків, включаючи рожевий, червоний та білий. Завдяки своїй унікальній формі на штамбі, ця рослина стає справжньою окрасою будь-якого інтер’єру. Азалії відомі своєю красою та елегантністю, але також вимагають уваги і догляду.',
			conditionsСare:
				'Азалія потребує яскравого, але розсіяного світла. Вона любить прохолоду і найкраще росте при температурі +15...+20 °C. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Важливо забезпечити їй високу вологість повітря, тому обприскування буде корисним. Після цвітіння рослину слід підрізати для підтримки її форми.',
			light: true,
			temperature: '+15...+20',
			watering: 'регулярний',
		},
		14: {
			name: 'Гортензія Мікс d10/h25',
			price: '1200',
			img: 'https://cdn.asterias.od.ua/images/5/5-1-88-700x705.jpg',
			flowerSize: '25',
			isFlowering: true,
			desc: "Гортензія Мікс — це яскрава кімнатна рослина з великими пишними квітами, які можуть мати різні відтінки: від блакитного до рожевого і білого. Вона відома своєю розкішною формою та пишним цвітінням, що робить її прекрасним акцентом у будь-якому інтер'єрі. Гортензії часто використовують для створення квіткових композицій і букетів.",
			conditionsСare:
				'Гортензія потребує яскравого, але розсіяного світла. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Вона любить високу вологість, тому обприскування листя буде корисним. Оптимальна температура для росту — +18...+24 °C. Після цвітіння рекомендується підрізати рослину для підтримки її форми і стимуляції нового росту.',
			light: true,
			temperature: '+18...+24',
			watering: 'регулярний',
		},
		15: {
			name: 'Карісса Balemala',
			price: '950',
			img: 'https://cdn.27.ua/sc--media--prod/default/10/a4/c0/10a4c0d7-5b2a-48e2-8095-dd20014032a3.jpg',
			flowerSize: '30-50',
			isFlowering: true,
			desc: 'Карісса Balemala — це компактна кімнатна рослина, що славиться своїми блискучими темно-зеленими листками та ароматними білими квітами, які переходять у маленькі червоні ягоди. Ця рослина не тільки приваблива, але й корисна, оскільки її ягоди їстівні та мають чудовий смак. Карісса чудово підходить для вирощування в контейнерах і може стати окрасою будь-якого інтер’єру.',
			conditionsСare:
				'Карісса Balemala потребує яскравого, але розсіяного світла. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Вона добре росте при температурі +18...+25 °C і потребує періодичного обприскування, особливо в суху пору року. Важливо також забезпечити рослину добрим дренажем, щоб уникнути застою води.',
			light: true,
			temperature: '+18...+25',
			watering: 'помірний',
		},
		16: {
			name: 'Антуріум Success Red',
			price: '1450',
			img: 'https://yaskravaklumba.com.ua/image/cache/catalog/komnatnye/anturium/succes-red_01-500x500.jpg',
			flowerSize: '40-60',
			isFlowering: true,
			desc: 'Антуріум Success Red — це вражаюча кімнатна рослина з яскравими червоними квітами у формі серця і блискучими зеленими листками. Ця рослина є символом краси та процвітання і часто використовується для декорування інтер’єрів завдяки своїй екзотичній естетиці. Антуріум також славиться своєю здатністю очищати повітря, що робить його популярним вибором для дому та офісу.',
			conditionsСare:
				'Антуріум Success Red потребує яскравого, але розсіяного світла для оптимального цвітіння. Поливати рослину слід регулярно, але уникати перезволоження; ґрунт повинен бути злегка вологим, але не мокрим. Оптимальна температура для росту — +18...+28 °C, а також важливо підтримувати високу вологість повітря. Підживлення рослини слід проводити кожні 4-6 тижнів під час вегетаційного періоду.',
			light: true,
			temperature: '+18...+28',
			watering: 'регулярний',
		},
		17: {
			name: 'Антуріум Black Queen',
			price: '1700',
			img: 'https://sharm24.com.ua/images/detailed/1/anthurium-an-black-queen-d17-l65.jpg',
			flowerSize: '50-70',
			isFlowering: true,
			desc: "Антуріум Black Queen — це вишукана кімнатна рослина, що вирізняється своїми темно-червоними або майже чорними квітами та глянцевими зеленими листками. Ця рослина додає екзотичності та елегантності будь-якому інтер'єру. Антуріум Black Queen не тільки привабливий, але й здатний очищати повітря, що робить його популярним вибором для дому та офісу.",
			conditionsСare:
				'Антуріум Black Queen потребує яскравого, але розсіяного світла для найкращого росту та цвітіння. Поливати рослину слід регулярно, дотримуючись помірності — ґрунт повинен бути вологим, але не мокрим. Оптимальна температура для росту — +18...+28 °C, і важливо підтримувати високу вологість повітря. Підживлення можна проводити кожні 4-6 тижнів під час вегетаційного періоду, щоб забезпечити рослині необхідні поживні речовини.',
			light: true,
			temperature: '+18...+28',
			watering: 'регулярний',
		},
		18: {
			name: 'Азалія Мікс 12х20',
			price: '950',
			img: 'https://img.auchan.ua/rx/q_90,ofmt_webp/auchan.ua/media/catalog/product/7/6/7600000115402_1.jpg',
			flowerSize: '20',
			isFlowering: true,
			desc: "Азалія Мікс 12х20 — це компактна кімнатна рослина, що має яскраві та пишні квіти різних відтінків, таких як рожевий, червоний та білий. Ця рослина відзначається своєю красою і є ідеальним вибором для прикраси інтер'єру, надаючи йому свіжого вигляду. Азалії дуже популярні завдяки своїй елегантності та здатності цвісти в зимовий період.",
			conditionsСare:
				'Азалія потребує яскравого, але розсіяного світла для оптимального зростання. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, проте важливо уникати перезволоження. Азалія найкраще росте при температурі +15...+20 °C і потребує високої вологості повітря, тому обприскування буде корисним. Після цвітіння рекомендується підрізати рослину для підтримки її форми.',
			light: true,
			temperature: '+15...+20',
			watering: 'регулярний',
		},

		19: {
			name: 'Хризантема',
			price: '450',
			img: 'https://cdn.asterias.od.ua/images/104/104-2-38-700x690.jpg',
			flowerSize: '30-50',
			isFlowering: true,
			desc: 'Хризантема — це яскрава і жива кімнатна рослина, відома своїми різноманітними кольорами та формами квітів. Ця рослина символізує радість і дружбу, а також є популярним вибором для декорування інтер’єрів завдяки своєму тривалому цвітінню. Хризантеми можуть мати квіти різних відтінків — від жовтого до червоного та білого, що робить їх чудовим доповненням до будь-якого простору.',
			conditionsСare:
				'Хризантема потребує яскравого сонячного світла для найкращого цвітіння, але також може переносити часткову тінь. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Оптимальна температура для росту — +15...+20 °C. Після цвітіння рослину рекомендується обрізати, щоб стимулювати новий ріст та підтримувати її форму.',
			light: true,
			temperature: '+15...+20',
			watering: 'регулярний',
		},
		20: {
			name: 'Троянда Мікс 10x20 см',
			price: '1200',
			img: 'https://movakvitiv.com/wp-content/uploads/2022/09/troyanda-mistse.jpg',
			flowerSize: '20',
			isFlowering: true,
			desc: 'Троянда Мікс 10x20 см — це компактна кімнатна рослина, що має яскраві, ароматні квіти в різних кольорах, таких як червоний, рожевий, білий і жовтий. Ця рослина не тільки прикрашає інтер’єр, але й наповнює його чудовим ароматом. Троянди символізують кохання та красу, що робить їх популярним вибором для подарунків та декорування.',
			conditionsСare:
				'Троянда потребує яскравого світла для оптимального зростання і цвітіння. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати перезволоження. Оптимальна температура для росту — +18...+24 °C. Рослина також потребує підживлення під час вегетаційного періоду, щоб забезпечити необхідні поживні речовини. Після цвітіння рекомендується обрізати зів’ялі квіти для стимуляції нового цвітіння.',
			light: true,
			temperature: '+18...+24',
			watering: 'регулярний',
		},

		22: {
			name: 'Ю-Джига Пеларгонія Розебудна 11х40 см',
			price: '980',
			img: 'https://cdn.27.ua/sc--media--prod/default/ae/f5/ff/aef5ff35-8075-463f-b338-6fd921d1013a.jpg',
			flowerSize: '40',
			isFlowering: true,
			desc: 'Ю-Джига Пеларгонія Розебудна — це яскрава кімнатна рослина, відома своїми красивими квітами, які нагадують троянди, і стійким ароматом. Ця рослина додає елегантності будь-якому простору завдяки своїм пишним і соковитим листям, а також розкішному цвітінню. Пеларгонія часто використовується для прикраси інтер’єрів, а також підходить для вирощування на балконах і в садах.',
			conditionsСare:
				"Пеларгонія потребує яскравого світла для оптимального росту і цвітіння. Поливати рослину слід помірно, даючи ґрунту підсохнути між поливами, щоб уникнути перезволоження. Оптимальна температура для росту — +18...+24 °C. Пеларгонія не любить холод і протяги, тому важливо забезпечити їй комфортні умови. Регулярне підживлення в період активного росту допоможе підтримувати її здоров'я та красу.",
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
	},
	Succulenta: {
		22: {
			name: 'Кактус Ехінопсис Мікс Різнокольоровий',
			price: '620',
			img: 'https://cdn.asterias.od.ua/images/26/26-1-37-700x702.jpg',
			flowerSize: '15-25',
			isFlowering: true,
			desc: 'Кактус Ехінопсис Мікс — це компактна кімнатна рослина, яка вражає своїми яскравими, різнокольоровими квітами, що розкриваються влітку. Ці кактуси мають характерні округлі форми та густі колючки, що робить їх привабливими для колекціонування. Ехінопсиси є невибагливими рослинами, які чудово підходять для початківців у світі кактусів.',
			conditionsСare:
				'Ехінопсис потребує яскравого сонячного світла для оптимального росту. Поливати кактус слід рідко, дозволяючи ґрунту повністю висохнути між поливами. Взимку полив майже зовсім зменшується. Оптимальна температура для росту — +18...+25 °C, а в зимовий період кактуси можуть витримувати температури до +10 °C. Ці рослини також не вимагають підживлення, але можуть виграти від додавання добрив під час вегетаційного періоду.',
			light: true,
			temperature: '+18...+25',
			watering: 'рідкий',
		},
		23: {
			name: 'Хавортія 5х5',
			price: '450',
			img: 'https://cdn.asterias.od.ua/images/136/136-14-20-700x583.jpg',
			flowerSize: '5',
			isFlowering: false,
			desc: "Хавортія — це компактна сукулентна рослина з характерними товстими, м'ясистими листками, які можуть бути темно-зеленими або з білими смужками. Ця рослина ідеально підходить для вирощування в кімнатних умовах, оскільки вона стійка до посухи та не вимагає складного догляду. Хавортія привносить зелені акценти у ваш інтер’єр і є чудовим вибором для початківців у світі кімнатних рослин.",
			conditionsСare:
				'Хавортія потребує яскравого, але розсіяного світла. Поливати рослину слід рідко, даючи ґрунту повністю висохнути між поливами. Вона добре переносить тепле і сухе середовище, тому оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити до мінімуму. Рослина не потребує частого підживлення, але можна використовувати добрива для кактусів у період активного росту.',
			light: true,
			temperature: '+18...+24',
			watering: 'рідкий',
		},
		24: {
			name: 'Алоє Мікс',
			price: '500',
			img: 'https://images.prom.ua/4904957266_w640_h640_aloe-perfoliata-aloe.jpg',
			flowerSize: '20-30',
			isFlowering: false,
			desc: 'Алоє Мікс — це сукулентна кімнатна рослина, відома своїми соковитими листками, що містять корисні речовини, які часто використовуються в медицині та косметології. Алоє має гарний зелений колір та характерні колючі краї, що робить його привабливим елементом декору. Ця рослина проста в догляді, ідеально підходить для початківців.',
			conditionsСare:
				'Алоє потребує яскравого світла, але може також рости в умовах часткової тіні. Поливати рослину слід рідко, даючи ґрунту повністю висохнути між поливами. Оптимальна температура для росту — +20...+25 °C. Взимку полив можна зменшити, оскільки рослина входить у стан спокою. Алоє не потребує частого підживлення, однак можна використовувати добрива для сукулентів у період активного росту.',
			light: true,
			temperature: '+20...+25',
			watering: 'рідкий',
		},
		25: {
			name: 'Сукулент Красула Овата',
			price: '600',
			img: 'https://cdn.asterias.od.ua/images/128/128-1-3-700x668.jpg',
			flowerSize: '25-30',
			isFlowering: false,
			desc: 'Красула Овата, також відома як "грошове дерево", — це популярна кімнатна рослина, яка вирізняється своїми круглими, м’ясистими листками та стійкістю до посухи. Вважається, що ця рослина приносить удачу та фінансовий добробут, що робить її бажаною для багатьох любителів рослин. Красула має компактну форму і добре підходить для вирощування в горщиках.',
			conditionsСare:
				'Красула Овата потребує яскравого світла, але може переносити і часткову тінь. Поливати рослину слід помірно, дозволяючи ґрунту повністю висохнути між поливами. Оптимальна температура для росту — +18...+24 °C. У зимовий період полив можна зменшити, оскільки рослина входить у стан спокою. Красула не потребує частого підживлення, але можна використовувати добрива для кактусів під час активного росту.',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
			26: {
				name: 'Ріпсаліс Мікс 17х30 см',
				price: '850',
				img: 'https://cdn.asterias.od.ua/images/48/48-5-19-700x549.jpg',
				flowerSize: '30',
				isFlowering: false,
				desc: 'Ріпсаліс Мікс — це унікальна кімнатна рослина з довгими, звисаючими стеблами, яка належить до родини кактусових. Ця рослина славиться своєю екзотичною естетикою і здатністю адаптуватися до різних умов. Ріпсаліс може мати різні варіації забарвлення, від яскраво-зеленого до сірувато-зеленого, і є ідеальним вибором для ампельних композицій.',
				conditionsСare:
					'Ріпсаліс потребує яскравого, розсіяного світла. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити. Ріпсаліс не потребує частого підживлення, але може виграти від додавання добрив для кактусів під час активного росту. Рослина також любить високу вологість, тому обприскування листя буде корисним.',
				light: true,
				temperature: '+18...+24',
				watering: 'помірний',
			},
			27: {
				name: 'Сансевієрія d12x40 Cylindrica',
				price: '750',
				img: 'https://a.allegroimg.com/original/1143a1/10ac7b9c4945b730d4340e80db02/Sansewieria-CYLINDRYCZNA-Sansevieria-WEZOWNICA-r-L-Nazwa-lacinska-sansevieria-cylindrica',
				flowerSize: '40',
				isFlowering: false,
				desc: 'Сансевієрія Cylindrica, або "зміїний язик", — це вражаюча кімнатна рослина з вертикальними, циліндричними листками, які можуть досягати значної висоти. Вона відома своєю здатністю витримувати різні умови вирощування, включаючи низьку освітленість і нерегулярний полив. Сансевієрія додає елегантності і сучасного вигляду будь-якому інтер’єру.',
				conditionsСare:
					'Сансевієрія потребує яскравого, але розсіяного світла, однак може рости і в умовах слабкого освітлення. Поливати рослину слід помірно, даючи ґрунту висохнути між поливами, щоб уникнути застою води. Оптимальна температура для росту — +18...+25 °C. Сансевієрія не потребує частого підживлення, але можна використовувати добрива для кактусів під час активного росту.',
				light: true,
				temperature: '+18...+25',
				watering: 'помірний',
			},

			28: {
				name: 'Сукулент',
				price: '400',
				img: 'https://floralife.com.ua/image/cache/catalog/houseplants/decorative-deciduous/haworthia-d10-15/haworthia-d10-15-2-1000x1000.jpg',
				flowerSize: '15-25',
				isFlowering: false,
				desc: 'Сукулент — це група рослин, які накопичують вологу в своїх листках, стеблах або коренях, що робить їх стійкими до посухи. Ці рослини мають різноманітні форми, кольори та текстури, що робить їх популярними для домашнього декору. Сукуленти прості в догляді, що робить їх ідеальним вибором для початківців у світі кімнатних рослин.',
				conditionsСare:
					'Сукуленти потребують яскравого світла, але можуть також рости в умовах часткової тіні. Поливати рослину слід рідко, даючи ґрунту повністю висохнути між поливами. Оптимальна температура для росту — +20...+25 °C. У зимовий період полив можна зменшити, оскільки рослини входять у стан спокою. Сукуленти не потребують частого підживлення, однак можна використовувати спеціалізовані добрива під час вегетаційного періоду.',
				light: true,
				temperature: '+20...+25',
				watering: 'рідкий',
			},
			29: {
				name: 'Кактус Ехінокактус Grusonii 27х25',
				price: '1200',
				img: 'https://cdn.asterias.od.ua/images/26/26-14-3-700x548.jpg',
				flowerSize: '25',
				isFlowering: true,
				desc: 'Кактус Ехінокактус Grusonii, відомий також як "золоте коло", — це видовий кактус, що характеризується великими, округлими формами і яскраво-жовтими колючками. Ця рослина вражає своєю естетикою і може стати справжнім акцентом у будь-якому інтер’єрі. Ехінокактус Grusonii є відносно простим у догляді, що робить його популярним вибором для любителів кактусів.',
				conditionsСare:
					'Ехінокактус потребує яскравого сонячного світла для оптимального росту і цвітіння. Поливати кактус слід рідко, дозволяючи ґрунту повністю висохнути між поливами, особливо в зимовий період. Оптимальна температура для росту — +18...+25 °C. Взимку кактус може витримувати нижчі температури, проте не нижче +10 °C. Ця рослина також не вимагає частого підживлення, однак можна використовувати спеціалізовані добрива для кактусів у період активного росту.',
				light: true,
				temperature: '+18...+25',
				watering: 'рідкий',
			},
		},
	},
	Citrus: {
		30: {
			name: 'Лимонне Дерево з Плодами 22/75 см',
			price: '2500',
			img: 'https://plantsroom.com.ua/wp-content/uploads/2024/07/img_8986.png',
			flowerSize: '75',
			isFlowering: true,
			desc: 'Лимонне дерево — це унікальна кімнатна рослина, яка не тільки прикрашає ваш простір, але й може давати плоди. Ця рослина славиться своїми ароматними жовтими лимонами і красивими зеленими листям. Лимонне дерево також додає свіжість і природний шарм до інтер’єру, роблячи його чудовим вибором для тих, хто любить садівництво.',
			conditionsСare:
				'Лимонне дерево потребує яскравого сонячного світла, тому розмістіть його біля вікна. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Оптимальна температура для росту — +20...+25 °C. Взимку рослина може потребувати зниження температури до +15 °C. Лимонне дерево також виграє від регулярного підживлення органічними добривами під час вегетаційного періоду.',
			light: true,
			temperature: '+20...+25',
			watering: 'регулярний',
		},

		31: {
			name: 'Лаймове Дерево Citrus Lime h 70 см',
			price: '2200',
			img: 'https://cdn.27.ua/sc--media--prod/default/7f/a2/2e/7fa22e51-da6a-4a78-b997-a7cb25685da3.jpg',
			flowerSize: '70',
			isFlowering: true,
			desc: 'Лаймове дерево Citrus Lime — це чудова кімнатна рослина, яка не тільки вражає своїм декоративним виглядом, але й приносить смачні плоди. Лаймове дерево має яскраві зелені листя і ароматні білі квіти, що робить його популярним серед садівників. Ця рослина додає свіжість і тропічний шарм до будь-якого інтер’єру.',
			conditionsСare:
				'Лаймове дерево потребує яскравого сонячного світла, тому розмістіть його на південному або західному вікні. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи перезволоження. Оптимальна температура для росту — +20...+25 °C. Взимку температура може бути трохи нижчою, близько +15 °C. Лаймове дерево також потребує підживлення органічними добривами в період активного росту для забезпечення належного розвитку і плодоносіння.',
			light: true,
			temperature: '+20...+25',
			watering: 'регулярний',
		},
		32: {
			name: 'Цісус Підвісний Mandaiana',
			price: '800',
			img: 'https://fleurplants.com.ua/image/cache/catalog/catalog/plants-to-1m/cissus-fp/cissus-fp-2-1200x800.jpg',
			flowerSize: '60',
			isFlowering: false,
			desc: 'Цісус Mandaiana — це вражаюча ампельна рослина, яка славиться своїм декоративним виглядом і швидким ростом. Її зелена листя має характерну форму і створює пишну завісу, що робить цю рослину ідеальною для підвісних горщиків. Цісус є відмінним вибором для тих, хто хоче додати зелений акцент у свій інтер’єр.',
			conditionsСare:
				"Цісус потребує яскравого, але розсіяного світла для оптимального росту. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку полив можна зменшити. Цісус не потребує частого підживлення, але можна використовувати рідкі добрива для кімнатних рослин у період активного росту, щоб підтримувати його здоров'я та красу.",
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},

		33: {
			name: 'Цитрус Каламондін 19х65 на Стовбурі з Плодами',
			price: '2700',
			img: 'https://plantsroom.com.ua/wp-content/uploads/2024/06/img_7694.png',
			flowerSize: '65',
			isFlowering: true,
			desc: 'Цитрус Каламондін — це декоративна кімнатна рослина, яка вражає своїми маленькими, ароматними плодами і пишною зеленню. Ця рослина має компактну форму, що робить її ідеальною для вирощування в горщиках. Каламондін не лише прикрашає інтер’єр, але й приносить плоди, які можна використовувати в кулінарії.',
			conditionsСare:
				'Каламондін потребує яскравого, розсіяного світла, тому розмістіть його біля вікна. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникати застою води. Оптимальна температура для росту — +20...+25 °C. Взимку рослина може витримувати трохи нижчу температуру, близько +15 °C. Для забезпечення належного розвитку і плодоносіння каламондін потребує регулярного підживлення органічними добривами в період активного росту.',
			light: true,
			temperature: '+20...+25',
			watering: 'регулярний',
		},
		34: {
			name: 'Цитрус Мандарин',
			price: '2400',
			img: 'https://kvitosvit.com.ua/2041/mandarin-kimnatnij-abkhazkij.jpg',
			flowerSize: '60',
			isFlowering: true,
			desc: 'Цитрус Мандарин — це популярна кімнатна рослина, яка не тільки прикрашає ваш простір, але й може приносити смачні плоди. Мандаринове дерево має красиві, темно-зелені листя та ароматні білі квіти, що робить його чудовим акцентом у будь-якому інтер’єрі. Ця рослина також відома своїми смачними, соковитими плодами, які радують своїм смаком.',
			conditionsСare:
				'Мандарин потребує яскравого, сонячного світла, тому розмістіть його на південному або західному вікні. Поливати рослину слід регулярно, підтримуючи вологість ґрунту, але уникаючи застою води. Оптимальна температура для росту — +20...+25 °C. Взимку температура може бути трохи нижчою, близько +15 °C. Для активного росту і плодоносіння мандарин потребує регулярного підживлення органічними добривами.',
			light: true,
			temperature: '+20...+25',
			watering: 'регулярний',
		},
	},
	Bonsai: {
		35: {
			name: 'Бонсай на камені Magic Gardens зі стабілізованими рослинами',
			price: '3200',
			img: 'https://magicgardens.com.ua/wp-content/uploads/2024/06/IMG_6246.jpg',
			flowerSize: '50',
			isFlowering: false,
			desc: 'Бонсай на камені Magic Gardens — це унікальна композиція зі стабілізованих рослин, яка поєднує в собі природну красу і сучасні дизайнерські рішення. Стабілізовані рослини не потребують поливу і догляду, зберігаючи свій вигляд протягом тривалого часу. Цей бонсай — це стильна декоративна прикраса для дому чи офісу, яка створює атмосферу спокою та гармонії.',
			conditionsСare:
				'Оскільки рослини стабілізовані, вони не потребують поливу, освітлення або добрив. Їх слід тримати подалі від прямих сонячних променів і не піддавати впливу високої вологості. Ідеальна температура для збереження стабілізованих рослин — кімнатна, від +18 до +24 °C. Ця композиція є повністю автономною і не вимагає активного догляду.',
			light: false,
			temperature: '+18...+24',
			watering: 'не потрібен',
		},

		36: {
			name: 'https://cdn.27.ua/sc--media--prod/default/2b/a4/25/2ba425d4-43d0-4df0-952c-1bf16dd2c7d0.jpg',
			price: '3500',
			img: 'https://cdn.asterias.od.ua/images/bonzai-waterfall.jpg',
			flowerSize: '60',
			isFlowering: false,
			desc: 'Бонсай над водоспадом Magic Gardens — це вражаюча композиція, яка поєднує в собі красу стабілізованих рослин і елементи водоспаду. Ця декоративна рослина створює атмосферу спокою та гармонії, роблячи будь-який простір більш затишним. Завдяки стабілізованим рослинам, бонсай зберігає свій природний вигляд без потреби в постійному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Їх слід зберігати в приміщенні з кімнатною температурою, уникаючи прямих сонячних променів і високої вологості. Оптимальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді, що є чудовим варіантом для будь-якого інтер’єру.',
			light: false,
			temperature: '+18...+24',
			watering: 'не потрібен',
		},
		37: {
			name: 'Фікус Бонсай Мікрокарпа',
			price: '1500',
			img: 'https://magicgardens.com.ua/wp-content/uploads/2023/02/IMG_8227.jpg',
			flowerSize: '30',
			isFlowering: false,
			desc: 'Фікус Бонсай Мікрокарпа — це елегантна і стильна кімнатна рослина, яка славиться своїми маленькими, глянцевими листочками і характерною формою стовбура. Ця рослина ідеально підходить для створення бонсай-композицій завдяки своїй здатності легко формуватися і піддаватися обрізанню. Фікус Мікрокарпа додасть витонченості та природної краси до будь-якого інтер’єру.',
			conditionsСare:
				'Фікус Мікрокарпа потребує яскравого, розсіяного світла, але може витримувати і часткову тінь. Поливати рослину слід помірно, дозволяючи верхньому шару ґрунту підсохнути між поливами. Оптимальна температура для росту — +18...+24 °C. Взимку слід уникати холодних протягів і забезпечувати рослині достатню вологість. Регулярне підживлення органічними добривами сприяє здоровому росту та розвитку рослини.',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		38: {
			name: 'Бонсай Magic Gardens у відкритій вазі 12х20 см',
			price: '1800',
			img: 'https://magicgardens.com.ua/wp-content/uploads/2023/04/IMG_8729.jpg',
			flowerSize: '20',
			isFlowering: false,
			desc: 'Бонсай Magic Gardens у відкритій вазі — це стильна і елегантна композиція, яка додасть вишуканості будь-якому інтер’єру. Завдяки своїй компактній формі і натуральному вигляду, цей бонсай стане чудовим акцентом на столі або підвіконні. Рослина вимагає мінімального догляду, що робить її ідеальним вибором для зайнятих людей.',
			conditionsСare:
				'Цей бонсай не потребує поливу, оскільки виготовлений з стабілізованих рослин. Рекомендується тримати його в приміщенні з кімнатною температурою, уникати прямих сонячних променів та високої вологості. Оптимальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді та ідеальним вибором для будь-якого простору.',
			light: false,
			temperature: '+18...+24',
			watering: 'не потрібен',
		},
		39: {
			name: 'Мосаріум Бонсай зі стабілізованими рослинами Сад імператора 25x20 см',
			price: '2500',
			img: 'https://cdn.27.ua/sc--media--prod/default/85/d0/cc/85d0cc35-b654-405e-b2d8-3afc86ff338a.jpg',
			flowerSize: '25',
			isFlowering: false,
			desc: 'Мосаріум Бонсай Сад імператора — це вражаюча композиція, яка поєднує стабілізовані рослини в елегантному дизайні. Ця рослина створює затишну атмосферу в будь-якому інтер’єрі, надаючи йому нотку природності та естетики. Завдяки стабілізованим рослинам, бонсай зберігає свій вигляд без потреби в регулярному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Рекомендується тримати мосаріум в кімнатній температурі, уникаючи прямих сонячних променів і високої вологості. Ідеальна температура для збереження композиції — від +18 до +24 °C. Це робить мосаріум легким у догляді та ідеальним для будь-якого простору.',
			light: false,
			temperature: '+18...+24',
			watering: 'не потрібен',
		},
		41: {
			name: 'Бонсай в банці Magic Gardens 25х12 см',
			price: '2000',
			img: 'https://cdn.27.ua/sc--media--prod/default/0d/aa/52/0daa5283-180e-4106-a601-7cba2bc93707.jpg',
			flowerSize: '12',
			isFlowering: false,
			desc: 'Бонсай в банці Magic Gardens — це унікальна декоративна композиція, яка поєднує в собі елегантність бонсая та стиль баночки. Ця рослина стане чудовим акцентом у вашому інтер’єрі, додаючи нотку природності та затишку. Завдяки стабілізованим рослинам, бонсай зберігає свій вигляд без потреби в регулярному догляді.',
			conditionsСare:
				'Стабілізовані рослини не потребують поливу, світла або добрив. Рекомендується розміщувати бонсай у кімнаті з нормальною температурою, уникаючи прямих сонячних променів і високої вологості. Ідеальна температура для збереження композиції — від +18 до +24 °C. Це робить бонсай легким у догляді та ідеальним вибором для будь-якого простору.',
			light: false,
			temperature: '+18...+24',
			watering: 'не потрібен',
		},
	},
};

app.get('/', (req, res) => {
	res.send('Welcome to the Plant API! Use /plants to see the list of plants.');
});

// Обробник для маршруту /plants
app.get('/plants', (req, res) => {
	res.json(plants);
});

// Обробник для отримання списку рослин за категорією
app.get('/plants/:category', (req, res) => {
	const category = req.params.category;
	const categoryPlants = plants[category];

	if (categoryPlants) {
		res.json(categoryPlants);
	} else {
		res.status(404).json({ message: 'Category not found' });
	}
});

// Обробник для отримання рослини за ID
app.get('/plants/id/:id', (req, res) => {
	const id = req.params.id;
	let foundPlant = null;

	// Шукаємо по всіх категоріях
	for (const category in plants) {
		if (plants[category][id]) {
			foundPlant = plants[category][id];
			break;
		}
	}

	if (foundPlant) {
		res.json(foundPlant);
	} else {
		res.status(404).json({ message: 'Plant not found' });
	}
});

// Запуск сервера
app.listen(port, () => {
	console.log(`Server running at http://localhost:${port}`);
});
