const express = require('express');
const app = express();
const port = process.env.PORT || 3000;

app.use(express.json());

const plants = {
	Orchidaceae: {
		0: {
			name: 'Дендробіум',
			price: 500,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/49/2d/1200x1200/ce67be92_6475f990b5b9d.JPG',
			flowerSize: '50',
			isFlowering: true,
			desc: 'це один з найпопулярніших родів орхідей, що налічує понад 1800 видів. Ці вражаючі рослини відомі своїм різноманіттям форм, кольорів та розмірів. Вони можуть мати стебла від коротких до довгих, а квіти — від маленьких до великих, зазвичай з яскравими і насиченими кольорами: від білого до рожевого, жовтого, фіолетового та навіть синього.',
			conditionsСare:
				'потребує яскравого, розсіяного освітлення і регулярного поливу, але слід уникати перезволоження. Рослина краще росте в спеціалізованому субстраті для орхідей, який забезпечує добру аерацію коренів. Підживлюйте її під час активного росту, використовуючи добрива для орхідей, щоб підтримувати здоров’я та рясне цвітіння.',
			light: true,
			temperature: '+18...+25',
			watering: 'помірний',
		},
		1: {
			name: 'Фаленопсис Біла Королівська',
			price: 700,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/5a/70/1200x1200/d96150a4_6358e68ec09cd.JPG',
			flowerSize: '70',
			isFlowering: true,
			desc: 'це царські квіти, які є дуже популярними серед квітникарів. Незважаючи на те, що королівська орхідея вважається більш вимогливою, ніж звичайна, з доглядом за нею справиться навіть новачок.Королівські орхідеї досить високі, мають великі квіти та тривале цвітіння, яке на 1-2 місяці довше, ніж у звичайних орхідей. У діаметрі квітки можуть досягати 20 см. А забарвлення буває абсолютно різне: білі, рожеві, в цятку, в смужку, фіолетові та багато інших. ',
			conditionsСare:
				'Для довгого цвітіння орхідеям потрібно багато світла. Ідеальні умови для них в місцях куди сонце потрапляє на декілька годин в день (зранку чи ввечері)',
			light: true,
			temperature: '+15...+30',
			watering: 'помірний',
		},
		2: {
			name: 'Міні орхідея мікс в кашпо',
			price: 2000,
			img: 'https://shop.camellia.ua/upload/kamelia_flora/photos/74/ea/1200x1200/28ea8b7_6066ee212b9ea.JPG',
			flowerSize: '35',
			isFlowering: true,
			desc: " це вишукана композиція з різних видів мініатюрних орхідей, представлених у стильному кашпо. Ці рослини відзначаються компактними розмірами, яскравими кольорами та елегантними формами, що робить їх ідеальними для прикраси будь-якого інтер'єру. Догляд за міні орхідеями простий: вони потребують яскравого, розсіяного світла і помірного поливу. Ця композиція додасть затишку і витонченості у ваш дім або офіс! ",
			conditionsСare:
				'Міні орхідея мікс потребує яскравого, розсіяного освітлення, помірного поливу і спеціалізованого субстрату для орхідей для підтримання здоров’я та цвітіння.',
			light: true,
			temperature: '+18...+25',
			watering: 'помірний',
		},
	},
	Foliage: {
		3: {
			name: 'Хамедорея',
			price: 500,
			img: 'https://polysad.com/media/cache/article_huge/chamaedorea1-660ec190e06af046980317.jpg.jpeg',
			flowerSize: '100',
			isFlowering: false,
			desc: ' це рід пальм, що включає різні види, висота яких може варіюватися. Зазвичай, вони досягають висоти від 1 до 3 метрів, в залежності від конкретного виду. Наприклад, Хамедорея елеганс (Chamaedorea elegans) зазвичай має висоту близько 1-1.5 метра.',
			conditionsСare:
				'Хамедорея потребує яскравого, розсіяного світла, помірного поливу з підсиханням верхнього шару ґрунту, високої вологості повітря, легкого дренованого субстрату та підживлення рідким добривом під час активного росту',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		4: {
			name: 'Фікус Лірата Бамбіно',
			price: 630,
			img: 'https://cdn.27.ua/sc--media--prod/default/e3/72/dc/e372dcdd-4cec-4c6e-90a2-bb1b9062f963.jpeg',
			flowerSize: '45',
			isFlowering: false,
			desc: "це компактна декоративно-листяна рослина з великими, вражаючими листками, які мають характерну хвилясту форму. Ця рослина додає елегантності будь-якому інтер'єру завдяки своїй пишній зелені і стрункій формі",
			conditionsСare:
				'потребує яскравого, розсіяного освітлення та помірного поливу, дозволяючи верхньому шару ґрунту підсохнути між поливами. Рекомендується регулярно обприскувати листя, щоб підтримувати необхідну вологість.',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		5: {
			name: 'Кротон Екселент',
			price: '749',
			img: 'https://flowers.ua/images/Flowers/articles/293-img-1.jpg',
			flowerSize: '70',
			isFlowering: false,
			desc: "це яскрава декоративно-листяна рослина, відома своїми великими, різнокольоровими листками, які мають насичені жовті, червоні та зелені відтінки. Завдяки своїй привабливій формі і кольору, ця рослина стає яскравим акцентом у будь-якому інтер'єрі.",
			conditionsСare:
				'Кротон Екселент потребує яскравого світла для підтримання насиченості кольорів, а полив має бути регулярним, дозволяючи верхньому шару ґрунту підсохнути між поливами. Важливо уникати застою води, щоб запобігти гниттю коренів',
			light: true,
			temperature: '+18...+24',
			watering: 'помірний',
		},
		6: {
			name: 'Заміокулькас',
			price: '1520',
			img: 'https://cdn.asterias.od.ua/images/81/81-2-61-700x700.jpg',
			flowerSize: '75',
			isFlowering: false,
			desc: 'відомий також як "щастя дерева" або "доларове дерево", є стійкою та невибагливою рослиною з глянцевими, темно-зеленими листками, які ростуть на м\'ясистих черешках. Ця рослина популярна завдяки своїй здатності витримувати низьку освітленість і нерегулярний полив, що робить її ідеальним вибором для офісів та житлових приміщень',
			conditionsСare:
				'потребує яскравого, але розсіяного світла, і не вимагає частого поливу — поливайте рослину, коли верхній шар ґрунту повністю підсохне. Важливо використовувати добре дренований ґрунт, щоб уникнути застою води.',
			light: false,
			temperature: '+15...+25',
			watering: 'помірний',
		},
		4: {
			name: '',
			price: '',
			img: '',
			flowerSize: '45',
			isFlowering: null,
			desc: '',
			conditionsСare: '',
			light: null,
			temperature: '+18...+24',
			watering: 'помірний',
		},
	},
};
app.get('/', (req, res) => {
	res.send('Welcome to the Plant API! Use /plants to see the list of plants.');
});

// Обробник для маршруту /plants
app.get('/plants', (req, res) => {
	res.json(plants);
});

// Обробник для отримання списку рослин за категорією
app.get('/plants/:category', (req, res) => {
	const category = req.params.category;
	const categoryPlants = plants[category];

	if (categoryPlants) {
		res.json(categoryPlants);
	} else {
		res.status(404).json({ message: 'Category not found' });
	}
});

// Обробник для отримання окремої рослини за ID
app.get('/plants/:category/:id', (req, res) => {
	const category = req.params.category;
	const id = req.params.id;
	const plant = plants[category] ? plants[category][id] : null;

	if (plant) {
		res.json(plant);
	} else {
		res.status(404).json({ message: 'Plant not found' });
	}
});

// Запуск сервера
app.listen(port, () => {
	console.log(`Server running at http://localhost:${port}`);
});
